[
    {
        "source": {
            "id": null,
            "name": "MacRumors"
        },
        "author": "Hartley Charlton",
        "title": "iPad Pro Now More Powerful Than iMac and Mac Mini - MacRumors",
        "description": "The iPad Pro is now more powerful than the iMac and the Mac mini due to featuring a more advanced chip, as the two desktop Macs are left with older...",
        "url": "https://www.macrumors.com/2022/11/24/ipad-pro-more-powerful-than-imac-mac-mini/",
        "urlToImage": "https://images.macrumors.com/t/6_BUQCM_UzMg-WLV53oqlqFy2GQ=/1960x/article-new/2018/11/ipad-pro-2022.jpg",
        "publishedAt": "2022-11-24T12:17:57Z",
        "content": "The iPad Pro is now more powerful than the iMac and the Mac mini due to featuring a more advanced chip, as the two desktop Macs are left with older hardware. \n The ‌iMac‌ and Apple's two ‌Mac mini‌ mo… The ‌iMac‌ and Apple's two ‌Mac mini‌ models have been left with the M1 chip from 2020, despite the launch of a plethora of devices featuring the M2 chip – meaning that they are outdated compared to the 13-inch MacBook Pro, redesigned MacBook Air, and ‌iPad Pro‌. Apple announced the M2 chip in early June this year at WWDC, offering around 20 percent better performance. The ‌M2‌ chip came to the 11-inch and 12.9-inch ‌iPad Pro‌ last month, offering a performance bump over the ‌M1‌ models from April 2021. \n Mac Otakara's Geekbench 5 results for the ‌M2‌ ‌iPad Pro‌ confirm a 15 to 16 percent increase in multi-core performance over models with the ‌M1‌ chip (8,516 score for 12.9-inch model with ‌M2‌ chip vs. 7,326 for the 12.9-inch model with ‌M1‌ chip): \n Since three different devices now contain the ‌M2‌ chip, the ‌iMac‌ and ‌Mac mini‌ are ripe for a chip upgrade. Even though adding an ‌M2‌ chip to the ‌iMac‌ and the ‌Mac mini‌ would presumably require limited internal changes, Apple has thus far neglected to do so. \n The situation is potentially embarrassing since the ‌iPad Pro‌ has come under fire for purportedly being unable to take advantage of the hardware it offers, while the ‌iMac‌ and ‌Mac mini‌ are fully-fledged desktop computers. \n Forecasts from Bloomberg's Mark Gurman suggest that an ‌iMac‌ with the ‌M2‌ chip is not on the horizon. Following the ‌M2‌ series of Macs, Gurman said a new ‌iMac‌ will be among the first Mac with M3 chips. It is not clear why Apple would exclude the ‌iMac‌ from the ‌M2‌ chip and wait until the ‌M3‌ chip is available, especially since this means that the current ‌M1‌ model would be around for a considerable amount of time, already being over a year and a half old. \n Reports earlier this year suggested that Apple originally had plans to introduce new ‌Mac mini‌ models in 2022, but these arrangements were probably scrapped in favor of the all-new Mac Studio. A new ‌Mac mini‌ with the standard M2 chip and a second higher-end model with the M2 Pro chip are purportedly still in the works for launch sometime in 2023. \n Apple is expected to announce new MacBook Pro models featuring the ‌M2‌ Pro and ‌M2‌ Max chips in a matter of months, which will become the most advanced Apple silicon chips to date. The launch of even more powerful Apple silicon hardware will only further highlight the extent to which the ‌iMac‌ and ‌Mac mini‌ seem to have been left behind.",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Goodwood Road and Racing"
        },
        "author": null,
        "title": "BMW 3.0 CSL is the ultimate 50th birthday present to M | GRR - Goodwood Road and Racing",
        "description": "Just 50 cars with 560PS, rear-wheel-drive and a manual transmission are to be made...",
        "url": "https://www.goodwood.com/grr/road/news/2022/11/bmw-3.0-csl-is-the-ultimate-50th-birthday-present-to-m/",
        "urlToImage": "https://www.goodwood.com/globalassets/.road--racing/road/news/2022/11-november/3.0-csl/3.0csl_goodwood_list.jpeg?crop=(0,0,1920,1080)&width=800",
        "publishedAt": "2022-11-24T11:21:24Z",
        "content": "Unlike the original ‘70s machine, much of the bodywork is made of carbon, including the roof, bonnet, bootlid, front and rear aprons, diffuser, sills and spoiler. That carbon diffuser and in fact, any underbody aero, is new compared to the old Batmobile, and of course houses the signature M quad exhausts. We think both the front and rear lights come from the M4 CSL, with the blistered arches covering parts of them to give a different shape. The large arches house 20 and 21-inch forged centre-lock wheels front and rear, with bespoke tyres. \n The CSL-isms continue on the inside too, with a hardcore Alcantara-clad cabin, special carbon bucket seats and a bespoke shift knob for the manual gearbox. Yes, this 560PS rear-drive monster is also a manual. Like in the M4 CSL, there are no back seats. Instead, ideal storage for your helmets.  \n Happily that power goes to the rear wheels via the clever Active M Differential. There’s a bespoke setup for the active M suspension and steering too, though as in the M3 and M4, all parameters are changeable to the driver’s desires.",
        "category": "general"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Joe O'Neill-Parker",
        "title": "Gotham Knights is Already Down to Just $35 - IGN",
        "description": "Gotham Knights has dropped to just $35 only weeks after release, that's 50% off the original list price.",
        "url": "https://www.ign.com/articles/black-friday-gotham-knights-down-to-35",
        "urlToImage": "https://assets-prd.ignimgs.com/2022/11/24/gotham-knights-is-already-down-to-35-ign-black-friday-1669292357465.png?width=1280",
        "publishedAt": "2022-11-24T12:23:13Z",
        "content": "Only weeks after its initial release, Gotham Knights has dropped to just $35 during the Black Friday sales, which is 50% off the original list price; F's in the chat for anyone who paid $70. This is a huge discount, especially for such a recent game. But, the price point definitely shouldn't be how you judge a game, so here's all the deal info you need if you're looking to pick it up before the holidays for yourself, or as a gift for a fellow Batman fan in your life. \n Retailers are really ramping down the prices for Black Friday at the moment and throwing out some big savings. Walmart has weighed in now with big savings on Gotham Knights for both PS5 and Xbox Series X. The title is currently available for $35 (down from $69.99), which, depending on your opinion, may or may not be a steal. If this deal doesn't interest you, we've also got a host of other great gaming deals at the end of this article; or you can check out our full Black Friday gaming deals roundup here. \n We'll be honest, we understand if you wanna pass this deal up. A lot of people didn't really like this game, we were pretty underwhelmed. The story was a bit weak, the combat was boring, and the frame rate was very inconsistent. We also just kept running into a lot of bugs that ranged from fairly amusing to annoying and hindering. It wasn't quite the triumphant return that many of us had expected. \n But that's just us, a lot of people find this game a whole heap of fun, and if you're one of those people, then here you go. Have all the fun for only 50% of the cost.",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Eurogamer.net"
        },
        "author": "Ed Nightingale",
        "title": "Sony dunks on Battlefield series in Microsoft Activision merger bid - Eurogamer.net",
        "description": "Sony has dunked on EA's Battlefield series in its arguments against Microsoft's buyout of Activision Blizzard. In docum…",
        "url": "https://www.eurogamer.net/sony-dunks-on-battlefield-series-in-microsoft-activision-merger-bid",
        "urlToImage": "https://assets.reedpopcdn.com/bf2042_ojtv1oJ_QOEfIMk.jpg/BROK/thumbnail/1600x900/format/jpg/quality/80/bf2042_ojtv1oJ_QOEfIMk.jpg",
        "publishedAt": "2022-11-24T12:19:23Z",
        "content": "Sony has dunked on EA's Battlefield series in its arguments against Microsoft's buyout of Activision Blizzard.\nIn documents released as part of the UK's Competition and Markets Authority review into the potential merger, Sony argues that Call of Duty \"is not replicable\" and that other games cannot compete with its success.\nIt then calls out the Battlefield series as a major rival, but says the franchise \"cannot keep up.\" \n \"Call of Duty is too entrenched for any rival, no matter how well equipped, to catch up,\" reads Sony's statement. \n \"It has been the top-selling game for almost every year in the last decade and, in the first-person shooter genre, it is overwhelmingly the top-selling game. Other publishers do not have the resources or expertise to match its success. \n \"To give a concrete example, Electronic Arts - one of the largest third-party developers after Activision - has tried for many years to produce a rival to Call of Duty with its Battlefield series. \n \"Despite the similarities between Call of Duty and Battlefield... the Battlefield franchise cannot keep up.\" \n It's fair to say that Battlefield is the biggest rival to Call of Duty, but the most recent game in the series has not been well received by fans.",
        "category": "general"
    },
    {
        "source": {
            "id": "techcrunch",
            "name": "TechCrunch"
        },
        "author": "Paul Sawers",
        "title": "LinkedIn’s rolling out a new feature that lets you schedule posts for later - TechCrunch",
        "description": "LinkedIn is quietly rolling out a new feature that allows users to schedule posts to send at a later date and time.",
        "url": "https://techcrunch.com/2022/11/24/linkedins-rolling-out-a-new-feature-that-lets-you-schedule-posts-for-later/",
        "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/11/GettyImages-1244671434.jpg?resize=1200,800",
        "publishedAt": "2022-11-24T12:15:44Z",
        "content": "LinkedIn is rolling out a new feature that allows users to schedule posts to send at a later time.\r\n The Microsoft-owned social network has seemingly been testing the new feature internally for several months already, according to at least one online report back in August from web developer and app researcher Nima Owji, but it seems that LinkedIn is now readying things for prime time, according to a growing number of reports across social media. \nMatt Navarra, a social media consultant and renowned tipster, confirmed yesterday that he was now seeing the post-scheduling feature inside the Android app and on the LinkedIn website itself. Internally at TechCrunch, it’s a bit of a mixed bag with some of us seeing the feature and others not, and we have managed to independently confirm the feature on the web. \n Those that do have the feature will see a little clock icon beside the “post” button within the message compose box.",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Space.com"
        },
        "author": "Space.com Staff",
        "title": "The Lego Galaxy Explorer set is now a stellar 50% off for Black Friday - Space.com",
        "description": "This retro-inspired Lego Galaxy Explorer kit is now just $50 in this Black Friday deal from Walmart - twice as good as last week's deal.",
        "url": "https://www.space.com/the-lego-galaxy-explorer-set-is-50-percent-off-for-black-friday",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/Z93FzVJNVQhfeGNffV4KVN-1200-80.jpg",
        "publishedAt": "2022-11-24T12:00:26Z",
        "content": "This Black Friday Lego deal at Walmart brings this classic build down to just $50 instead of $100.\r\nLego has been around for decades, and that means the company is able to pull from previously iconic… [+2029 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Macworld"
        },
        "author": "David Price",
        "title": "Best Apple Watch Black Friday deals 2022 - Macworld",
        "description": "Grab a bargain on one of Apple's popular smartwatches during the deals season.",
        "url": "https://www.macworld.com/article/1376743/best-apple-watch-black-friday-deals-nov-24.html",
        "urlToImage": "https://www.macworld.com/wp-content/uploads/2022/11/mw-Apple-Watch-bf-primary.jpg?quality=50&strip=all&w=1024",
        "publishedAt": "2022-11-24T11:48:45Z",
        "content": "Skip to contentType your search and hit enter\r\nWhen you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence\r\n.\r\nBlack Friday comes b… [+4347 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "MacRumors"
        },
        "author": "Tim Hardwick",
        "title": "Apple Ditched Plan for $50 Apple Pencil With iPhone Support at the Last Minute, Claims Sketchy Rumor - MacRumors",
        "description": "Apple planned to introduce a new $49 Apple Pencil this year that was compatible with iPhones, but scrapped the plans at the last minute, claims a...",
        "url": "https://www.macrumors.com/2022/11/24/apple-pencil-for-iphone-plan-scrapped-rumor/",
        "urlToImage": "https://images.macrumors.com/t/UO7a6VpQd6ge74uhiL776oqkpdY=/2500x/article-new/2022/06/apple-pencil-red.jpg",
        "publishedAt": "2022-11-24T11:37:26Z",
        "content": "Apple planned to introduce a new $49 Apple Pencil this year that was compatible with iPhones, but scrapped the plans at the last minute, claims a sketchy new rumor coming out of Asia.\r\nAccording to a… [+1880 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Andre Wegner",
        "title": "What Nvidia’s New Text-To-3D Means For Engineering & Product Design - Forbes",
        "description": "Magic3D is reportedly over twice as fast as DreamFusion, published less than 2 months prior. The rapid changes in Generative AI have huge implications for engineering and manufacturing.",
        "url": "https://www.forbes.com/sites/andrewegner/2022/11/24/what-nvidias-new-text-to-3d-means-for-engineering--product-design/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/637f5288847cbf8aada0e34c/0x0.png?format=png&crop=2570,1445,x0,y51,safe&width=1200",
        "publishedAt": "2022-11-24T11:18:18Z",
        "content": "tl;dr: Generative AI is evolving at an exhilarating pace. The latest algorithm by Nvidia converts text into 3D mesh twice as fast as projects published barely 2 months ago. This means that the techni… [+7166 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Zigwheels.com"
        },
        "author": null,
        "title": "More Affordable Porsche 911, More Powerful Taycan & More Stylish 718 Derivatives Come To India - ZigWheels",
        "description": "With these new additions, Porsche has bolstered its Indian lineup, but we hope to get the Dakar here soon",
        "url": "https://www.zigwheels.com/news-features/general-news/more-affordable-porsche-911-more-powerful-taycan-more-stylish-718-derivatives-come-to-india/47830/",
        "urlToImage": "https://media.zigcdn.com/media/content/2022/Nov/cover_637f500f12432.jpg",
        "publishedAt": "2022-11-24T11:11:27Z",
        "content": "Get latest updates on the automobile community\r\n<ul><li>Porsche 911 T launched at Rs 1.81 crore (ex-showroom).\r\n</li><li>Porsche Taycan GTS launched at Rs 1.95 crore (ex-showroom), slots between 4S a… [+2676 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Motor1 "
        },
        "author": "Adrian Padeanu",
        "title": "Rebodied Mazda MX-5 With Posh Interior Marks Coachbuilder's Anniversary - Motor1 ",
        "description": "Spanish coachbuilder Hurtan will be giving six Mazda MX-5 Miata roadsters a retro exterior and a far more luxurious cabin.",
        "url": "https://www.motor1.com/news/623395/hurtan-grand-albaycin-miata-2023/",
        "urlToImage": "https://cdn.motor1.com/images/mgl/pb0kog/s1/2023-hurtan-grand-albaycin-special-edition.jpg",
        "publishedAt": "2022-11-24T11:10:00Z",
        "content": "Spanish coachbuilder Hurtan has been rebodying cars since 1992 and is now celebrating its 30th anniversary with a fancy Mazda MX-5. The Miata ND-based Grand Albaycín has been around in both soft top … [+1657 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Sportskeeda"
        },
        "author": "Jason Parker",
        "title": "God of War Ragnarok: How to find and solve The Crucible Nornir Chest (Muspelheim) - Sportskeeda",
        "description": "Most of God of War Ragnarok’s Nornir Chests require some puzzle-solving. Some of them are timed, and others you have to do a bit of extra exploring for.",
        "url": "https://www.sportskeeda.com/esports/god-war-ragnarok-how-find-solve-the-crucible-nornir-chest-muspelheim",
        "urlToImage": "https://staticc.sportskeeda.com/editor/2022/11/1b468-16691969156364-1920.jpg",
        "publishedAt": "2022-11-24T11:09:03Z",
        "content": "Most of God of War Ragnaroks Nornir Chests require some puzzle-solving. Some of them are timed, and others you have to do a bit of extra exploring for. This one, in particular, is based in a region o… [+3015 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Eric Song",
        "title": "These Black Friday Deals Make 2TB PS5 SSD Storage Upgrades Worth Buying - IGN",
        "description": "Save on WD, Samsung, XPG, Crucial, and More",
        "url": "https://www.ign.com/articles/best-black-friday-deals-2tb-ps5-ssd-storage-upgrade",
        "urlToImage": "https://assets-prd.ignimgs.com/2022/11/24/bfssd-1669286863192.jpg?width=1280",
        "publishedAt": "2022-11-24T11:03:52Z",
        "content": "If you want to upgrade your PS5's internal storage without compromising on speed, any old SSD just won't cut it. You'll want to pick up an PCIe Gen4 x4 M.2 solid state drive with a rated 5,500MB/s re… [+1278 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "GSMArena.com"
        },
        "author": "Sagar",
        "title": "Realme 10 Pro series is launching globally on December 8 - GSMArena.com news - GSMArena.com",
        "description": "The lineup was unveiled last week in China.",
        "url": "https://www.gsmarena.com/realme_10_pro_10_pro_plus_global_launch_date-news-56643.php",
        "urlToImage": "https://fdn.gsmarena.com/imgroot/news/22/11/realme-10-pro-series-global-launch-date/-952x498w6/gsmarena_002.jpg",
        "publishedAt": "2022-11-24T11:01:01Z",
        "content": "The Realme 10 Pro and 10 Pro+ unveiled last week in China will begin their global journey on December 8. The launch event will begin at 3PM UTC +8, except in India, where Realme will hold a separate … [+917 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Space.com"
        },
        "author": "Lloyd Coombes",
        "title": "Become a superhero with this Black Friday PlayStation VR deal - Space.com",
        "description": "Sony’s PlayStation VR headset is under $200 with a free game in Best Buy's Black Friday PSVR deal.",
        "url": "https://www.space.com/become-a-superhero-with-black-friday-psvr-deal",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/pEcSW8oiSQwbNP2apPjSKo-1200-80.jpg",
        "publishedAt": "2022-11-24T11:00:38Z",
        "content": "PlayStation VR 2 may be on the way in 2023, but that doesn’t mean you should forget about Sony’s first foray into console-based VR gaming.\r\nOne of the best VR headsets\r\n available, the PlayStation VR… [+1987 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Beebom"
        },
        "author": "Vanshika Malhotra",
        "title": "Oppo Reno 9 Series Launched in China; Check out the Details! - Beebom",
        "description": "Oppo has launched the new Reno 9 series in China with up to 80W fast charging, Android 13, and more. Check out the price, features, and specs.",
        "url": "https://beebom.com/oppo-reno-9-series-launch-china/",
        "urlToImage": "https://beebom.com/wp-content/uploads/2022/11/oppo-reno-9-series-launched.jpg",
        "publishedAt": "2022-11-24T10:54:29Z",
        "content": "As announced earlier, Oppo has launched the Reno 9 series in China. The lineup includes the Oppo Reno 9, the Reno 9 Pro, and the Reno 9 Pro+, succeeding the Reno 8 Series, which launched in May this … [+3207 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Sportskeeda"
        },
        "author": "Abhishek Mallick",
        "title": "Where to use the Taraq Smuggler’s Office key in Warzone 2 DMZ? - Sportskeeda",
        "description": "There are a fair number of missions and challenges that you can complete when playing the DMZ mode in Warzone 2.",
        "url": "https://www.sportskeeda.com/esports/where-use-taraq-smuggler-s-office-key-warzone-2-dmz",
        "urlToImage": "https://staticg.sportskeeda.com/editor/2022/11/5e240-16692852811378-1920.jpg",
        "publishedAt": "2022-11-24T10:50:44Z",
        "content": "There are a fair number of missions and challenges that you can complete when playing the DMZ mode in Warzone 2. There are a lot of mission-related items that you will come across when taking down en… [+2056 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Pocket-lint"
        },
        "author": "Pocket-lint",
        "title": "Grab the OnePlus Buds Pro for just $79.99 in the Black Friday sales - Pocket-lint",
        "description": "With a huge 47 per cent reduction in the Black Friday sales, OnePlus' flagship earbuds offer incredible value for money.",
        "url": "https://www.pocket-lint.com/headphones/news/black-friday/163586-oneplus-buds-pro-black-friday-deal",
        "urlToImage": "https://cdn.pocket-lint.com/r/s/1200x630/assets/images/163586-headphones-news-grab-the-oneplus-buds-pro-for-just-79-in-the-black-friday-sales-image1-yvupxs17hr.jpg",
        "publishedAt": "2022-11-24T10:45:00Z",
        "content": "(Pocket-lint) - The OnePlus Buds Pro are a seriously good set of TWS earbuds, especially if you own a OnePlus phone.\r\nThe problem is that at their launch price of $150, they were lost in a sea of sim… [+1347 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "GTPlanet"
        },
        "author": "Andrew Evans",
        "title": "Gran Turismo 7 Update 1.26 is Now Available: Adds Road Atlanta and Car Selling Feature - GTPlanet",
        "description": "The latest update for Gran Turismo 7 is now with us, and it brings a host of new content, higher value events, and one of the most-requested features since the launch of Gran Turismo Sport in 2017. Coming in at just over 2.5GB on PlayStation 4 and just under …",
        "url": "https://www.gtplanet.net/gran-turismo-7-update-126-20221124/",
        "urlToImage": "https://www.gtplanet.net/wp-content/uploads/2022/11/image-2-10.jpg",
        "publishedAt": "2022-11-24T10:31:02Z",
        "content": "The latest update for Gran Turismo 7 is now with us, and it brings a host of new content, higher value events, and one of the most-requested features since the launch of Gran Turismo Sport in 2017.\r\n… [+7939 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "AZoM"
        },
        "author": null,
        "title": "How Forensic Labs Investigate Automobile Paint Chip Layers - AZoM",
        "description": "This article outlines how forensic labs investigate automobile paint chip layers.",
        "url": "https://www.azom.com/article.aspx?ArticleID=22199",
        "urlToImage": "https://d12oja0ew7x0i8.cloudfront.net/images/Article_Images/ImageForArticle_22199_1669116773734344.png",
        "publishedAt": "2022-11-24T10:30:00Z",
        "content": "Forensic laboratories are often tasked with reconstructing the evidence when a hit-and-run accident has been reported and one of the vehicles involved has fled the scene.\r\nResidual evidence can range… [+14123 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Nature.com"
        },
        "author": null,
        "title": "Antagonist muscle torque at the ankle interfere with maximal voluntary contraction under isometric and anisometric conditions | Scientific Reports - Nature.com",
        "description": "Scientific Reports - Antagonist muscle torque at the ankle interfere with maximal voluntary contraction under isometric and anisometric conditions",
        "url": "https://www.nature.com/articles/s41598-022-24752-y",
        "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-24752-y/MediaObjects/41598_2022_24752_Fig1_HTML.png",
        "publishedAt": "2022-11-24T10:28:28Z",
        "content": "<li>Solomonow, M., Baratta, R., Zhou, B. H. &amp; DAmbrosia, R. Electromyogram coactivation patterns of the elbow antagonist muscles during slow isokinetic movement. Exp. Neurol.100, 470477 (1988).\r\n… [+13884 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Motor1 "
        },
        "author": "Angel Sergeev",
        "title": "Mazda RX-7 Barn Find Gets First Wash And Detail In 23 Years - Motor1 ",
        "description": "This could very well be one of the shiniest RX-7s we’ve ever seen and the truth is it is in almost concours condition.",
        "url": "https://www.motor1.com/news/623365/mazda-rx-7-first-wash-video/",
        "urlToImage": "https://cdn.motor1.com/images/mgl/W89elL/s1/mazda-rx-7-wash.jpg",
        "publishedAt": "2022-11-24T10:27:00Z",
        "content": "To date, the RX-7 is possibly the most recognizable vehicle Mazda has ever built. The third generation of the sports car was produced between 1992 and 2002 and was one of the most inspiring mass-prod… [+1692 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Robert Anderson",
        "title": "Best 4K Blu-ray Black Friday Deals: Perfect For PS5 and Xbox Series X Owners - IGN",
        "description": "4K Blu-rays are on sale for Black Friday at the moment, including a great selection included in Amazon's Buy 2 Get 1 Free sale as well.",
        "url": "https://www.ign.com/articles/best-4k-blu-ray-black-friday-deals-live",
        "urlToImage": "https://assets-prd.ignimgs.com/2022/11/24/best-4k-blu-ray-black-friday-deals-live-ign-2-1669285155720.png?width=1280",
        "publishedAt": "2022-11-24T10:22:34Z",
        "content": "Black Friday deals are here, and there's plenty to get stuck into already. Every year our favorite selection of Black Friday deals is suitably enhanced by an impressive selection of 4K Blu-ray discou… [+1735 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Macworld"
        },
        "author": "Karen Haslam",
        "title": "Best Mac Black Friday Deals 2022 - Macworld",
        "description": "There are already lots of Black Friday deals to be had! You can save money on a new Mac, including the iMac and Mac mini with these great deals and discounts.",
        "url": "https://www.macworld.com/article/1373696/best-mac-black-friday-deals-nov-24.html",
        "urlToImage": "https://www.macworld.com/wp-content/uploads/2022/11/mw-all-macs-bf-primary-1.jpg?quality=50&strip=all&w=1024",
        "publishedAt": "2022-11-24T10:21:28Z",
        "content": "Skip to contentType your search and hit enter\r\nWhen you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence\r\n.\r\nBlack Friday is tomo… [+7141 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "GSMArena.com"
        },
        "author": "Yordan",
        "title": "Oppo Reno9 series debut: Pro+ comes with Snadpragon 8+ Gen 1, 16GB RAM - GSMArena.com news - GSMArena.com",
        "description": "Both the Pro and Pro+ have 16 GB RAM as a base option.",
        "url": "https://www.gsmarena.com/oppo_reno9_series_official-news-56640.php",
        "urlToImage": "https://fdn.gsmarena.com/imgroot/news/22/11/oppo-reno-9-ofic/-952x498w6/gsmarena_001.jpg",
        "publishedAt": "2022-11-24T10:12:01Z",
        "content": "Oppo announced today a trio of Reno9 smartphones - a vanilla Reno9 with Snapdragon 778G, a Reno9 Pro that shares the same body but runs on Dimensity 8100, and a mighty Reno9 Pro+ with Snapdragon 8+ G… [+4059 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Nature.com"
        },
        "author": null,
        "title": "Spatiotemporal image quality of virtual reality head mounted displays | Scientific Reports - Nature.com",
        "description": "Scientific Reports - Spatiotemporal image quality of virtual reality head mounted displays",
        "url": "https://www.nature.com/articles/s41598-022-24345-9",
        "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-24345-9/MediaObjects/41598_2022_24345_Fig1_HTML.jpg",
        "publishedAt": "2022-11-24T10:07:59Z",
        "content": "Spatial performance of VR displays\r\nFigure 5 compares the spatial resolution of the VIVE (a), VIVE Pro (b) and VIVE Pro 2 (c). As illustrated in the example images of the static single-pixel white li… [+15969 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Barry Collins",
        "title": "Google Stadia Refund Blunder Gives Gamers An Unexpected Windfall - Forbes",
        "description": "Mistake sees lucky Google Stadia customers get hundreds of dollars' worth of unexpected refunds",
        "url": "https://www.forbes.com/sites/barrycollins/2022/11/24/google-stadia-refund-blunder-gives-gamers-an-unexpected-windfall/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/637f3fe06bba3df212a0e34a/0x0.jpg?format=jpg&width=1200",
        "publishedAt": "2022-11-24T10:00:43Z",
        "content": "Some Stadia customers are getting unexpected refunds\r\nFuture Publishing via Getty Images\r\nAn apparent error by Google has resulted in some Stadia subscribers getting refunds that they werent entitled… [+1420 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Zoznam.sk"
        },
        "author": "Dominik Farkaš",
        "title": "Sony tvrdí, že ak Microsoft získa Activision Blizzard tak „poškodí vývojárov“ a „zvýši ceny hier a konzol“ - Gamesite.sk",
        "description": "Ugh?",
        "url": "https://gamesite.zoznam.sk/xbox/xbox-scarlett/novinky/50196-sony-tvrdi-ze-ak-microsoft-ziska-activision-blizzard-tak-poskodi-vyvojarov-a-zvysi-ceny-hier-a-konzol",
        "urlToImage": "https://images.gamesite.sk/perex/202211/50196.jpg",
        "publishedAt": "2022-11-24T09:59:52Z",
        "content": "Ugh?\r\nSpolonosti Microsoft a Sony sa dostali do celkom ostrého konfliktu kvôli plánovanej akvizícii vydavatestva Activision Blizzard. Sony je toti zásadne proti a preto pouíva vetky dostupné argument… [+2313 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Graphene-Info"
        },
        "author": null,
        "title": "Researchers study the effects of defects on electron emission of Graphene electrodes - Graphene-Info",
        "description": "Researchers from the Chinese Academy of Sciences, the University of Science and Technology of China and North China University of Water Resources and Electric Power have studied the effects of irradiation defects on the work function of graphene electrodes in…",
        "url": "https://www.graphene-info.com/researchers-study-effects-defects-electron-emission-graphene-electrodes",
        "urlToImage": null,
        "publishedAt": "2022-11-24T09:53:28Z",
        "content": "Researchers from the Chinese Academy of Sciences, the University of Science and Technology of China and North China University of Water Resources and Electric Power have studied the effects of irradi… [+1938 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Paul Tan's Automotive News"
        },
        "author": "Gerard Lye",
        "title": "2023 BMW 3.0 CSL - iconic name returns for 50-unit celebratory special based on the M4; 560 PS with 6MT - paultan.org - Paul Tan's Automotive News",
        "description": "BMW is not holding back when it comes to celebrating the 50th anniversary of its well-known M division this year, and before 2022 draws to a close, the company is presenting this, the new 3.0 …",
        "url": "https://paultan.org/2022/11/24/2023-bmw-3-0-csl-debuts-50-unit-limited-production/",
        "urlToImage": "https://paultan.org/image/2022/11/2023-BMW-3.0-CSL-debut-17-1200x628.jpg",
        "publishedAt": "2022-11-24T09:51:16Z",
        "content": "BMW is not holding back when it comes to celebrating the 50th anniversary of its well-known M division this year, and before 2022 draws to a close, the company is presenting this, the new 3.0 CSL. \r\n… [+4062 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Video Games Chronicle"
        },
        "author": "Chris Scullion",
        "title": "The Callisto Protocol's DLC death animations 'aren't being held back' from the main game, creator says | VGC - Video Games Chronicle",
        "description": "Glen Schofield claims they'll be created after the game is released due to fan demand…",
        "url": "https://www.videogameschronicle.com/news/the-callisto-protocols-dlc-death-animations-arent-being-held-back-from-the-main-game-creator-says/",
        "urlToImage": "https://www.videogameschronicle.com/files/2022/06/52118036106_f1d33c03c7_h.jpg",
        "publishedAt": "2022-11-24T09:50:16Z",
        "content": "The creator of The Callisto Protocol has sought to clarify the decision to include player death animations as part of the game’s season pass.\r\nYesterday VGC reported that the season pass will include… [+1513 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Business Insider India"
        },
        "author": "George Glover",
        "title": "Activision stock drops after report says watchdog will try to block $69 billion Microsoft deal - Business Insider India",
        "description": "Activision shares fell 4% in after-hours trading Wednesday.The Federal Trade Commission is weighing up filing an antitrust lawsuit to block Microsoft's acquisition",
        "url": "https://www.businessinsider.in/investment/news/activision-stock-drops-after-report-says-watchdog-will-try-to-block-69-billion-microsoft-deal/articleshow/95739087.cms",
        "urlToImage": "https://www.businessinsider.in/photo/95739087/activision-stock-drops-after-report-says-watchdog-will-try-to-block-69-billion-microsoft-deal.jpg?imgsize=53060",
        "publishedAt": "2022-11-24T09:46:00Z",
        "content": "Activision Blizzard shares fell in after-hours trading Wednesday after a report suggested regulators will try to block Microsoft's $69 billion deal to buy the video-game publisher.\r\nActivision fell a… [+1398 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Eric Song",
        "title": "Save $600 on the 48\" LG UltraGear 4K OLED Gaming Monitor with This Black Friday Deal - IGN",
        "description": null,
        "url": "https://www.ign.com/articles/black-friday-lg-ultragear-48gp900-4k-oled-gaming-monitor-deal",
        "urlToImage": "https://assets-prd.ignimgs.com/2022/11/24/lgbfoledmonitor-1669282230110.jpg?width=1280",
        "publishedAt": "2022-11-24T09:43:08Z",
        "content": "Amazon just dropped the price on the 48\" LG 48GP900-B 4K OLED gaming monitor by a whopping $600 for Black Friday. This monitor was released earlier in 2022 for a starting MSRP of $1500. Previously, i… [+1971 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "Yahoo Entertainment"
        },
        "author": "Ken Martin",
        "title": "Microsoft bid for Activision likely to be blocked by FTC lawsuit: report - Yahoo Finance",
        "description": "Microsoft's proposed $69 billion takeover of Activision Blizzard could reportedly be blocked by an FTC lawsuit.",
        "url": "https://finance.yahoo.com/news/microsoft-bid-activision-likely-blocked-071608664.html",
        "urlToImage": "https://s.yimg.com/ny/api/res/1.2/aaB5t2RSBUbCMF96j.7u4g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/fox_business_text_367/242c0a696049a481031a72777cc4a545",
        "publishedAt": "2022-11-24T09:42:57Z",
        "content": "Microsoft's bid to acquire the video game publisher Activision Blizzard reportedly could face a major roadblock as early as next month.\r\nThe U.S. Federal Trade Commission (FTC) is likely to file an a… [+2082 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": null,
            "name": "MacRumors"
        },
        "author": "Tim Hardwick",
        "title": "HBO Max Working on App Fix for Playback Errors on Apple TV 4K Devices - MacRumors",
        "description": "HBO is working on a fix for \"can't play title\" errors that some users have been encountering in the HBO Max app for Apple TV, according...",
        "url": "https://www.macrumors.com/2022/11/24/hbo-max-app-playback-errors-apple-tv/",
        "urlToImage": "https://images.macrumors.com/t/SzKczUzqyyd3ztShOWvNnxUd9cE=/1600x/article-new/2022/04/hbo-max-apple-tv-shadow.jpeg",
        "publishedAt": "2022-11-24T09:41:09Z",
        "content": "HBO is working on a fix for \"can't play title\" errors that some users have been encountering in the HBO Max app for Apple TV, according to The Verge.\r\nThe issue, which has been widely reported by use… [+914 chars]",
        "category": "general"
    },
    {
        "source": {
            "id": "reuters",
            "name": "Reuters"
        },
        "author": null,
        "title": "Mobileye beats revenue estimates in first quarterly report since IPO - Reuters",
        "description": "Mobileye Global Inc <a href=\"https://www.reuters.com/companies/MBLY.O\" target=\"_blank\">(MBLY.O)</a> beat estimates for revenue and earnings on Wednesday in its first quarterly report after going public in October, as the Intel Corp <a href=\"https://www.reuter…",
        "url": "https://www.reuters.com/technology/mobileye-beats-revenue-estimates-first-quarterly-report-since-ipo-2022-12-07/",
        "urlToImage": "https://www.reuters.com/resizer/G9NV2pF9weGux9uav6oH1G_amJ4=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/ZOIYDBU7IRMZ5GT2FWHSYAZL2A.jpg",
        "publishedAt": "2022-12-07T14:36:00Z",
        "content": "Dec 7 (Reuters) - Mobileye Global Inc (MBLY.O) beat estimates for revenue and earnings on Wednesday in its first quarterly report after going public in October, as the Intel Corp (INTC.O) unit benefited from strong demand for its self-driving technology from carmakers. \n Shares of the company were up about 2% at $31 in premarket trading, after it also forecast a revenue range for the current quarter that came in well above expectations. \n A push to incorporate assistive-driving capabilities to bolster safety features in cars has led to greater adoption of self-driving technology, helping companies such as Mobileye. \n Total revenue at Mobileye grew 38% to $450 million in the third quarter ended Oct. 1. Analysts were expecting revenue of $447 million, according to Refinitiv data. \n Net loss, however, widened to $45 million from $26 million. On an adjusted basis, the company earned 15 cents per share, above analysts' estimates of 12 cents, according to Refinitiv.",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "PRNewswire"
        },
        "author": null,
        "title": "CB Insights Names Clarius Mobile Health to Its Digital Health 150 List - PR Newswire",
        "description": "/PRNewswire/ -- CB Insights today named Clarius Mobile Health to its fourth-annual Digital Health 150, showcasing the 150 most promising private digital health...",
        "url": "https://www.prnewswire.com/news-releases/cb-insights-names-clarius-mobile-health-to-its-digital-health-150-list-301696387.html",
        "urlToImage": "https://mma.prnewswire.com/media/1962928/Clarius_Mobile_Health__one_of_150_companies_selected_from_a_pool_of_more_than_13000_private_compani.jpg?p=facebook",
        "publishedAt": "2022-12-07T14:17:00Z",
        "content": "NEW YORK, Dec. 7, 2022 /PRNewswire/ -- CB Insights today named Clarius Mobile Health to its fourth-annual Digital Health 150, showcasing the 150 most promising private digital health companies of 2022. A leading provider of high-definition wireless ultrasound systems, Clarius helps clinicians from a broad range of specialties improve patient care, expand their services, and differentiate their medical practices with real-time imaging inside the body. \n  \"From reimagining clinical care, to leveraging tech like AR/VR to improve surgical training, this year's Digital Health 150 winners are transforming the future of healthcare with digital technology,\" said Brian Lee, SVP of CB Insights' Intelligence Unit. \"This increasingly global cohort, representing more than 18 countries across five continents, is not only driving better patient outcomes, but making healthcare more accessible. We are excited to follow the meaningful impact and continued success of this year's winners.\" ",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "The Guardian"
        },
        "author": "Jennifer Rankin",
        "title": "City faces fresh post-Brexit blow as EU moves to restrict certain trades - The Guardian",
        "description": "Battle focuses on what EU sees as bloc’s over-reliance on London’s clearing houses handling euro-denominated derivatives",
        "url": "https://www.theguardian.com/business/2022/dec/07/city-faces-fresh-post-brexit-blow-as-eu-moves-to-restrict-certain-trades",
        "urlToImage": "https://i.guim.co.uk/img/media/3665465c05b8116c45ccc28cee9f8d457f3beffc/295_0_4685_2812/master/4685.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fc7eecba5e6a6568db4f2b919f64b13e",
        "publishedAt": "2022-12-07T14:12:00Z",
        "content": "The City of London faces another post-Brexit blow to its dominance after the EU moved to require firms to settle more financial-risk reducing trades within the bloc.\r\nThe plan centres on trades in se… [+3411 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "PRNewswire"
        },
        "author": null,
        "title": "HONEYWELL AND REUTERS SURVEY REVEALS DRAMATIC INCREASE IN SUSTAINABILITY INITIATIVES IN BUILDINGS - PR Newswire",
        "description": "/PRNewswire/ -- Greater energy efficiency, better indoor air quality (IAQ) and meeting environmental, social and governance (ESG) guidelines are three...",
        "url": "https://www.prnewswire.com/news-releases/honeywell-and-reuters-survey-reveals-dramatic-increase-in-sustainability-initiatives-in-buildings-301696795.html",
        "urlToImage": "https://mma.prnewswire.com/media/430032/Honeywell_Logo.jpg?p=facebook",
        "publishedAt": "2022-12-07T14:00:00Z",
        "content": "<ul><li>For 87% of those surveyed, reaching carbon neutrality with their building portfolios ranks high in importance among overall sustainability goals </li></ul>ATLANTA, Dec. 7, 2022 /PRNewswire/ -… [+7228 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "Investing.com"
        },
        "author": "Reuters",
        "title": "Oil edges up from lows on Chinese demand hopes, tanker delays By Reuters - Investing.com",
        "description": "Oil edges up from lows on Chinese demand hopes, tanker delays",
        "url": "https://www.investing.com/news/commodities-news/oil-opens-mixed-as-economic-fears-pressure-prices-2958685",
        "urlToImage": "https://i-invdn-com.investing.com/news/LYNXMPEABT05G_L.jpg",
        "publishedAt": "2022-12-07T13:35:00Z",
        "content": "By Alex Lawler\r\nLONDON (Reuters) -Oil edged up on Wednesday after Brent crude earlier fell close to its lowest in 2022, as hopes of higher Chinese demand and concern about Russian supply arising from… [+2192 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "CNBC"
        },
        "author": "Amelia Lucas",
        "title": "McDonald's hopes deals like 50-cent double cheeseburgers beef up sales on its mobile app - CNBC",
        "description": "More than a year after its U.S. launch, McDonald's loyalty program had 25 million active members, as of Sept. 30.",
        "url": "https://www.cnbc.com/2022/12/07/mcdonalds-seasonal-promotions-digital-sales-growth.html",
        "urlToImage": "https://image.cnbcfm.com/api/v1/image/107162545-1670421834592-gettyimages-1239680554-RAFAPRESS_01042022-3028.jpeg?v=1670421913&w=1920&h=1080",
        "publishedAt": "2022-12-07T13:32:03Z",
        "content": "Last holiday season, McDonald's leaned on singer Mariah Carey's starpower and discounts to drive customers to their mobile app.\r\nThis year, the Chicago-based restaurant giant is going further, giving… [+3455 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "Euronews"
        },
        "author": "Rosie Frost",
        "title": "How much could countries save if the EU raises its renewable energy target by just 5%? - Euronews",
        "description": "Energy ministers are voting next week on whether to raise targets from 40 to 45 per cent by 2050, a move which experts say would have a huge impact.",
        "url": "https://www.euronews.com/green/2022/12/07/heres-how-much-countries-could-save-if-the-eu-raises-its-renewable-energy-target-by-just-5",
        "urlToImage": "https://static.euronews.com/articles/stories/07/23/65/14/1000x563_cmsv2_28bb7372-388c-5e4f-bb56-210c72b4404f-7236514.jpg",
        "publishedAt": "2022-12-07T13:24:36Z",
        "content": "Boosting the EUs ambition on renewable energy could halve gas imports and save billions of euros.\r\nA small step up in ambition for renewables would make a massive difference, according to energy thin… [+2617 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": "reuters",
            "name": "Reuters"
        },
        "author": null,
        "title": "Volkswagen to invest $482 mln to make electric compact car at Wolfsburg - Reuters",
        "description": "Volkswagen <a href=\"https://www.reuters.com/companies/VOWG_p.DE\" target=\"_blank\">(VOWG_p.DE)</a> will invest 460 million euros ($482 million) by early 2025 in its Wolfsburg plant, with most of the funds to be spent for the production of the electric ID.3 mode…",
        "url": "https://www.reuters.com/business/autos-transportation/volkswagen-invest-482-million-electrifying-wolfsburg-plant-2022-12-07/",
        "urlToImage": "https://www.reuters.com/resizer/L4WpAggeBM5HYJG8bup9Rs49viY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/2X6U5UZMPVKSTDTPFC53YSJD2M.jpg",
        "publishedAt": "2022-12-07T13:21:00Z",
        "content": "BERLIN, Dec 7 (Reuters) - Volkswagen (VOWG_p.DE) will invest 460 million euros ($482 million) by early 2025 in its Wolfsburg plant, with most of the funds to be spent for the production of the electr… [+1912 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "Barron's"
        },
        "author": "Karishma Vanjani",
        "title": "Jamie Dimon Predicts Recession Again. This Metric Backs Him Up. - Barron's",
        "description": "The JPMorgan Chase CEO first predicted a slowdown in October, saying a U.S. downturn would arrive in six to nine months.",
        "url": "https://www.barrons.com/articles/jamie-dimon-recession-51670354576",
        "urlToImage": "https://images.barrons.com/im-641795/social",
        "publishedAt": "2022-12-07T13:12:00Z",
        "content": "JPMorgan Chase\r\nCEO Jamie Dimon raised concerns about the economy sliding into a recession yet again on Tuesday. \r\nWhile the U.S. economy continues to be the strongest globally, rising interest rates… [+485 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "SpaceNews"
        },
        "author": "Debra Werner",
        "title": "TriSept and SpiderOak unveil strategic partnership - SpaceNews",
        "description": "TriSept, a launch integration and mission management specialist, announced a strategic partnership Dec. 7 with cybersecurity firm SpiderOak to offer an “end-to-end security system” for satellites and ground systems.",
        "url": "https://spacenews.com/trisept-and-spideroak-unveil-strategic-partnership/",
        "urlToImage": "https://spacenews.com/wp-content/uploads/2022/12/rsz_1screen_shot_2022-12-06_at_31827_pm.png",
        "publishedAt": "2022-12-07T13:03:18Z",
        "content": "WASHINGTON TriSept, a launch integration and mission management specialist, announced a strategic partnership Dec. 7 with cybersecurity firm SpiderOak to offer an end-to-end security system for satel… [+2256 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": "reuters",
            "name": "Reuters"
        },
        "author": null,
        "title": "Oil falls close to 2022 lows on economic worries, easing supply fears - Reuters",
        "description": "Oil edged up on Wednesday after Brent crude earlier fell close to its lowest in 2022, as hopes of higher Chinese demand and concern about Russian supply arising from tanker delays in Turkish waters offset recession fears.",
        "url": "https://www.reuters.com/markets/commodities/oil-opens-mixed-economic-fears-pressure-prices-2022-12-07/",
        "urlToImage": "https://www.reuters.com/resizer/wYaWkyfnFJosb5hVpTuQXye6HvU=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/Q2J5AAFMEJITPFEPWKVQBAMWCY.jpg",
        "publishedAt": "2022-12-07T12:47:00Z",
        "content": "LONDON, Dec 7 (Reuters) - Oil edged up on Wednesday after Brent crude earlier fell close to its lowest in 2022, as hopes of higher Chinese demand and concern about Russian supply arising from tanker … [+2361 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "CNBC"
        },
        "author": "Peter Schacknow",
        "title": "Stocks making the biggest moves premarket: Campbell Soup, Pinterest, Toll Brothers and others - CNBC",
        "description": "These are the stocks posting the largest moves before the bell.",
        "url": "https://www.cnbc.com/2022/12/07/stocks-making-the-biggest-moves-premarket-campbell-soup-pinterest-toll-brothers-and-others.html",
        "urlToImage": "https://image.cnbcfm.com/api/v1/image/103910024-GettyImages-505908958.jpg?v=1670417187&w=1920&h=1080",
        "publishedAt": "2022-12-07T12:46:27Z",
        "content": "Check out the companies making headlines before the bell:\r\nCampbell Soup (CPB) Campbell Soup beat estimates by 14 cents with adjusted quarterly earnings of $1.02 per share. Revenue also beat consensu… [+2315 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "CNBC"
        },
        "author": "Silvia Amaro",
        "title": "Some crypto backers are purposely taking a 'very dangerous path,' EU regulator says - CNBC",
        "description": "The European Union has been stepping up rules in this space and has pushed for a global approach.",
        "url": "https://www.cnbc.com/2022/12/07/crypto-regulation-europes-mcguinness-pushes-for-global-rules-after-ftx-collapse.html",
        "urlToImage": "https://image.cnbcfm.com/api/v1/image/107162327-1670396462618-gettyimages-1243941534-IIF_MEETING_2022.jpeg?v=1670416789&w=1920&h=1080",
        "publishedAt": "2022-12-07T12:39:49Z",
        "content": "BRUSSELS Some market players are purposely avoiding regulation in the crypto space, the EU's top regulator told CNBC as she called for a global approach to protect retail investors.\r\nThe European Uni… [+2242 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": "reuters",
            "name": "Reuters"
        },
        "author": null,
        "title": "Futures fall on growing fears of recession - Reuters",
        "description": "U.S. stock index futures edged lower on Wednesday after warnings of a looming recession from major Wall Street bankers offset optimism around the easing of China's strict zero-COVID rules.",
        "url": "https://www.reuters.com/markets/us/futures-fall-growing-fears-recession-2022-12-07/",
        "urlToImage": "https://www.reuters.com/resizer/PpONK81J251-ZaVlKmxu5cSzTjc=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/Y3CMUTXUYJPO3FGR5QNGT43B4Q.jpg",
        "publishedAt": "2022-12-07T12:22:00Z",
        "content": "Dec 7 (Reuters) - U.S. stock index futures edged lower on Wednesday after warnings of a looming recession from major Wall Street bankers offset optimism around the easing of China's strict zero-COVID… [+2501 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "Decrypt"
        },
        "author": "Alys Key",
        "title": "US Court Unseals Indictment of OneCoin Cryptoqueen's 'Crisis Manager' - Decrypt",
        "description": "The Luxembourg national linked to the OneCoin scheme is to be extradited to the U.S. on charges of wire fraud and money laundering.",
        "url": "https://decrypt.co/116621/us-court-unseals-indictment-onecoin-crypto-queen-crisis-manager",
        "urlToImage": "https://img.decrypt.co/insecure/rs:fill:1024:512:1:0/plain/https://cdn.decrypt.co/wp-content/uploads/2022/12/onecoin-crypto-gID_1.jpg@png",
        "publishedAt": "2022-12-07T12:03:44Z",
        "content": "Another player in the notorious OneCoin scheme will face charges of wire fraud and money laundering upon extradition to the U.S., according to a newly unsealed indictment.\r\nThe document details charg… [+2715 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "CNBC"
        },
        "author": "Diana Olick",
        "title": "Mortgage demand falls again even as rates sink further - CNBC",
        "description": "Lower mortgage rates are pulling some current homeowners back to the refinance market, but not enough to offset the drop in demand from homebuyers.",
        "url": "https://www.cnbc.com/2022/12/07/mortgage-demand-falls-again-interest-rates-decline.html",
        "urlToImage": "https://image.cnbcfm.com/api/v1/image/107162211-1670370490991-gettyimages-1245416106-US_HOUSING_MARKET.jpeg?v=1670414401&w=1920&h=1080",
        "publishedAt": "2022-12-07T12:00:01Z",
        "content": "Lower mortgage rates are pulling some current homeowners back to the refinance market, but not enough to offset the drop in demand from homebuyers. \r\nMortgage application volume fell 1.9% last week c… [+1596 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "PRNewswire"
        },
        "author": null,
        "title": "GreenPower Announces Enhanced Collaboration with Gemilang International and Order for Right-Hand Drive All-Electric Trucks and Vans - PR Newswire",
        "description": "/PRNewswire/ -- GreenPower Motor Company Inc. (NASDAQ: GP) (TSXV: GPV) (\"GreenPower\"), a leading manufacturer and distributor of zero-emission,...",
        "url": "https://www.prnewswire.com/news-releases/greenpower-announces-enhanced-collaboration-with-gemilang-international-and-order-for-right-hand-drive-all-electric-trucks-and-vans-301696539.html",
        "urlToImage": "https://mma.prnewswire.com/media/1593965/GreenPower_Motor_Company_Logo.jpg?p=facebook",
        "publishedAt": "2022-12-07T12:00:00Z",
        "content": "LOS ANGELES, Dec. 7, 2022 /PRNewswire/ -- GreenPower Motor Company Inc. (NASDAQ: GP) (TSXV: GPV) (\"GreenPower\"), a leading manufacturer and distributor of zero-emission, electric-powered, medium and … [+6199 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "PRNewswire"
        },
        "author": null,
        "title": "EDITION Announces Global Expansion Plan - PR Newswire",
        "description": "/PRNewswire/ -- Under the new leadership of Josh Fluhr, Senior Vice President and Global Managing Director, EDITION Hotels is driving global expansion with the...",
        "url": "https://www.prnewswire.com/news-releases/edition-announces-global-expansion-plan-301696737.html",
        "urlToImage": "https://mma.prnewswire.com/media/1962985/Expansion_Renderings.jpg?p=facebook",
        "publishedAt": "2022-12-07T12:00:00Z",
        "content": "Expected to grow portfolio to 30 properties by 2027\r\nFILM: EDITION Global Evolution\r\nBETHESDA, Md., Dec. 7, 2022 /PRNewswire/ -- Under the new leadership of Josh Fluhr, Senior Vice President and Glob… [+8960 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "CNBC"
        },
        "author": "Mike Calia",
        "title": "5 things to know before the stock market opens Wednesday - CNBC",
        "description": "Here are the most important news items that investors need to start their trading day.",
        "url": "https://www.cnbc.com/2022/12/07/5-things-to-know-before-the-stock-market-opens-wednesday-december-7.html",
        "urlToImage": "https://image.cnbcfm.com/api/v1/image/107161880-NYSE-Trading-Floor-OB-20221206-CC-PRESS-5.jpg?v=1670413524&w=1920&h=1080",
        "publishedAt": "2022-12-07T11:45:24Z",
        "content": "Traders on the floor of the NYSE\r\nHere are the most important news items that investors need to start their trading day:\r\n1. Can stocks get over the hump?\r\nU.S. equities markets entered Wednesday in … [+4380 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "Moneycontrol"
        },
        "author": "Manish M. Suvarna",
        "title": "How is e-rupee different from UPI? | Five takeaways from the RBI governor’s press conference - Moneycontrol",
        "description": "Since the launch of the pilot programe of the retail central bank digital currency, there has been some confusion about where the digital currency and UPI fit.",
        "url": "https://www.moneycontrol.com/news/business/how-is-e-rupee-different-from-upi-five-takeaways-from-the-rbi-governors-press-conference-9666181.html",
        "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/CBDC_shutterstock_1935478135-770x433.png",
        "publishedAt": "2022-12-07T11:43:40Z",
        "content": "Reserve Bank of India (RBI) governor Shaktikanta Das on Wednesday, December 7, clarified the difference between the digital rupee and Unified Payments Interface (UPI). Speaking at the post-policy pre… [+3748 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "MyBroadband"
        },
        "author": "https://www.facebook.com/mybroadband",
        "title": "Most loved and hated banks in South Africa — with one slipping badly - MyBroadband",
        "description": "DataEQ’s analysis has shown South Africa’s banking sector had the most positive net sentiment score of any industry in the past year.",
        "url": "https://mybroadband.co.za/news/banking/473019-most-loved-and-hated-banks-in-south-africa-with-one-slipping-badly.html",
        "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2022/09/Capitec-Branch.jpg",
        "publishedAt": "2022-12-07T11:42:26Z",
        "content": "Banking was among South Africa’s “most liked” industries in the past year, beating retail, insurance, and telecommunications.\r\nThat is according to the SA Banking Sentiment Index for 2022 compiled by… [+3950 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "FXStreet"
        },
        "author": "Cointelegraph Team",
        "title": "Report outlines reasons why stakeholders are against CBDC - FXStreet",
        "description": "While some countries like Nigeria are aggressively pushing the use of central bank digital currencies (CBDCs), a new report summarized why a number of",
        "url": "https://www.fxstreet.com/cryptocurrencies/news/report-outlines-reasons-why-stakeholders-are-against-cbdc-202212071138",
        "urlToImage": "https://editorial.fxstreet.com/images/Resources/vpn-for-crypto-trading_Large.jpg",
        "publishedAt": "2022-12-07T11:38:35Z",
        "content": "While some countries like Nigeria are aggressively pushing the use of central bank digital currencies (CBDCs), a new report summarized why a number of private stakeholders are against the idea of a C… [+1792 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "Investor's Business Daily"
        },
        "author": "Investor's Business Daily",
        "title": "Market Rally Wipes Out Powell Gains As Apple, Exxon Skid; What To Do Now | Investor's Business Daily - Investor's Business Daily",
        "description": "Major indexes erase yet another big one-day jump.",
        "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-market-rally-wipes-out-powell-gains-as-apple-exxon-tesla-skid/",
        "urlToImage": "https://www.investors.com/wp-content/uploads/2022/06/Stock-jeromepowell2022-05-gov.jpg",
        "publishedAt": "2022-12-07T11:35:00Z",
        "content": "Dow Jones futures fell early Wednesday, along with S&amp;P 500 futures and Nasdaq futures. Tesla stock retreated as the EV giant offered another price incentive in China.\r\nXThe stock market rally had… [+8524 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": "financial-times",
            "name": "Financial Times"
        },
        "author": "Leo Lewis",
        "title": "China's reopening to reverberate around global markets - Financial Times",
        "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication",
        "url": "https://www.ft.com/content/dab940ab-3fd5-49cc-b37c-a6b4a49b0699",
        "urlToImage": null,
        "publishedAt": "2022-12-07T11:33:22Z",
        "content": "What is included in my trial?\r\nDuring your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages.\r\nStandard Digital includ… [+1496 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "Global News"
        },
        "author": "The Canadian Press",
        "title": "Bank of Canada expected to announce 7th interest rate hike this year - National | Globalnews.ca - Global News",
        "description": "The Bank of Canada began raising interest rates in March in response to rapidly rising inflation that peaked at 8.1 per cent in July.",
        "url": "https://globalnews.ca/news/9331253/bank-of-canada-interest-rate-dec-2022/",
        "urlToImage": "https://globalnews.ca/wp-content/uploads/2022/12/20221206231212-639012e33df158e60f328d8fjpeg.jpg?quality=85&strip=all&w=720&h=379&crop=1",
        "publishedAt": "2022-12-07T11:31:12Z",
        "content": "The Bank of Canada is expected to raise its key interest rate Wednesday, making it the seventh consecutive time it does so this year.\r\nThe central bank will publish its rate decision at 10 a.m. accom… [+603 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "FXStreet"
        },
        "author": "Pablo Piovano",
        "title": "Philippines: Inflation accelerates to a 14-year high in November – UOB - FXStreet",
        "description": "UOB Group’s Senior Economist Julia Goh and Economist Loke Siew Ting assess the latest inflation figures in the Philippines. Key Takeaways “Headline in",
        "url": "https://www.fxstreet.com/news/philippines-inflation-accelerates-to-a-14-year-high-in-november-uob-202212071126",
        "urlToImage": "https://editorial.fxstreet.com/images/Macroeconomics/Countries/Asia/Philippines/philippines_flag1_Large.jpg",
        "publishedAt": "2022-12-07T11:26:10Z",
        "content": "UOB Group’s Senior Economist Julia Goh and Economist Loke Siew Ting assess the latest inflation figures in the Philippines.\r\n“Headline inflation accelerated for the third straight month to a 14-year … [+1437 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "Team-BHP"
        },
        "author": "Tushar Kelshikar",
        "title": "Hyundai Creta facelift scores 5-stars in ASEAN NCAP crash test - Team-BHP",
        "description": "ASEAN NCAP has awarded the Hyundai Creta facelift a 5-star safety rating. The SUV scored 34.72 points for adult occupant safety and 15.56 points for child occupant protection. In the frontal offset test, the SUV offered good protection to the occupants, while…",
        "url": "https://www.team-bhp.com/news/hyundai-creta-facelift-scores-5-stars-asean-ncap-crash-test",
        "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/Hyundai-Creta (1).jpg",
        "publishedAt": "2022-12-07T11:24:26Z",
        "content": "ASEAN NCAP has awarded the Hyundai Creta facelift a 5-star safety rating. The SUV scored 34.72 points for adult occupant safety and 15.56 points for child occupant protection.\r\nIn the frontal offset … [+852 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "BBC News"
        },
        "author": "https://www.facebook.com/bbcnews",
        "title": "Rail strikes: Passengers warned not to travel by train next week - BBC",
        "description": "Disruption will be inevitable even if strikes are called off passengers are warned",
        "url": "https://www.bbc.com/news/business-63885058",
        "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/E1FB/production/_127915875_trainstation-index-getty.jpg",
        "publishedAt": "2022-12-07T11:20:15Z",
        "content": "Train passengers are to be told to only travel next week if it is absolutely necessary, even if rail worker strikes are called off at the last minute.\r\nWorkers at the UK's biggest rail union, the RMT… [+4734 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": "financial-times",
            "name": "Financial Times"
        },
        "author": "Valentina Romei",
        "title": "UK house prices fall at fastest rate in 14 years, says Halifax - Financial Times",
        "description": "Rising borrowing costs squeeze prospective homebuyers, sparking a 2.3% decline for November",
        "url": "https://www.ft.com/content/872ae7f3-b010-46e8-8dfc-991bfb7fd174",
        "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fff91c9e7-4d2e-45ef-b8ea-c7d8c899ab84.jpg?source=next-opengraph&fit=scale-down&width=900",
        "publishedAt": "2022-12-07T11:02:19Z",
        "content": "UK house prices have fallen for a third consecutive month and at the fastest pace since the 2008 financial crisis as rising borrowing costs squeezed prospective homebuyers.\r\nData published on Wednesd… [+3335 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "Cointelegraph"
        },
        "author": "David Attlee",
        "title": "Japan recommends against algorithmic backing in stablecoins - Cointelegraph",
        "description": "Japan's current regulation, which was passed by Parliament in June and will become law in June 2023, doesn’t cover algorithmic stablecoins.",
        "url": "https://cointelegraph.com/news/japan-recommends-against-algorithmic-backing-in-stablecoins",
        "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/format=auto,onerror=redirect,quality=90,width=1200/https://s3.cointelegraph.com/uploads/2022-12/f00b2752-484f-4542-ba55-fb4e9e4c0e27.jpg",
        "publishedAt": "2022-12-07T10:52:20Z",
        "content": "After passing its landmark legislation on stablecoins in June, Japanese regulators are considering complementing it by restricting the algorithmic backing of stablecoins. The intention comes as a rec… [+1969 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "BBC News"
        },
        "author": "https://www.facebook.com/bbcnews",
        "title": "Fenwick to shut 130-year-old New Bond Street department store - BBC",
        "description": "Chairman Simon Claver says the sale has \"been a difficult decision for the Fenwick family\".",
        "url": "https://www.bbc.com/news/uk-england-london-63880285",
        "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/C3B5/production/_127910105_gettyimages-1229947718.jpg",
        "publishedAt": "2022-12-07T10:48:31Z",
        "content": "Department store Fenwick has announced it will close its 130-year-old store on New Bond Street in central London.\r\nThe store, along with the adjoining property, has been sold to Lazari Investments an… [+1242 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "Theexpresswire.com"
        },
        "author": "TheExpressWire",
        "title": "Death Care Market Strategic Analysis, Emerging Trends, Industry Outlook and Future Scenarios and Growth by 2023-2027 - Digital Journal",
        "description": "The exclusive research report on the Global Death Care Market 2023-2027 examines the market in detail along with focusing on significant market dynamics",
        "url": "https://www.theexpresswire.com/pressrelease/Death-Care-Market-Strategic-Analysis-Emerging-Trends-Industry-Outlook-and-Future-Scenarios-and-Growth-by-2023-2027_18549435",
        "urlToImage": null,
        "publishedAt": "2022-12-07T10:38:27Z",
        "content": "The exclusive research report on the Global Death Care Market 2023-2027 examines the market in detail along with focusing on significant market dynamics for the key players operating in the market. G… [+9977 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "CoinDesk"
        },
        "author": "Jamie Crawley",
        "title": "Binance Generates 90% of Revenue From Transaction Fees, Changpeng Zhao Says - CoinDesk",
        "description": "Reinstating ads on CoinMarketCap would add $40 million a year.",
        "url": "https://www.coindesk.com/business/2022/12/07/binance-generates-90-of-revenue-from-transaction-fees-changpeng-zhao-says/",
        "urlToImage": "https://www.coindesk.com/resizer/5P_bRRzF4VCyZKfEAXcRhzpmP34=/1200x628/center/middle/cloudfront-us-east-1.images.arcpublishing.com/coindesk/GM6ISVTCFFADNOXNAOCIEH3K5Q.jpg",
        "publishedAt": "2022-12-07T10:32:00Z",
        "content": "Please note that ourprivacy policy,terms of use,cookies, anddo not sell my personal informationhas been updated.\r\nThe leader in news and information on cryptocurrency, digital assets and the future o… [+538 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "CP24 Toronto's Breaking News"
        },
        "author": null,
        "title": "Bank of Canada to announce interest rate decision this morning - CP24",
        "description": "The Bank of Canada is expected to raise its key interest rate today, making it the seventh consecutive time it does so this year.",
        "url": "https://www.cp24.com/news/bank-of-canada-to-announce-interest-rate-decision-this-morning-1.6184116",
        "urlToImage": "https://www.cp24.com/polopoly_fs/1.6184117.1670408847!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
        "publishedAt": "2022-12-07T10:28:02Z",
        "content": "OTTAWA - The Bank of Canada is expected to raise its key interest rate today, making it the seventh consecutive time it does so this year.\r\nThe central bank will publish its rate decision at 10 a.m. … [+640 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "GSMArena.com"
        },
        "author": "Michail",
        "title": "Apple brings new pricing and equalization tools to the App Store - GSMArena.com news - GSMArena.com",
        "description": "The new pricing features will be available to developers in Spring 2023.",
        "url": "https://www.gsmarena.com/apple_brings_new_pricing_and_equalization_tools_to_the_app_store-news-56785.php",
        "urlToImage": "https://fdn.gsmarena.com/imgroot/news/22/12/apple-700-new-price-points-app-store/-952x498w6/gsmarena_00.jpg",
        "publishedAt": "2022-12-07T10:28:01Z",
        "content": "Apple is bringing more app pricing options to developers starting in Spring 2023. The lowest supported price point will be $0.29 while the highest price point is now $10,000. Devs will also gain the … [+1352 chars]",
        "category": "business"
    },
    {
        "source": {
            "id": null,
            "name": "MLB Trade Rumors"
        },
        "author": "Steve Adams",
        "title": "Yankees, Aaron Judge Agree To Record-Setting Deal - MLB Trade Rumors",
        "description": "The Yankees have agreed to a record-setting nine-year contract with reigning American League MVP Aaron Judge. Read more at MLB Trade Rumors.",
        "url": "https://www.mlbtraderumors.com/2022/12/yankees-to-sign-aaron-judge.html",
        "urlToImage": "https://cdn.mlbtraderumors.com/files/2022/08/aaron-judge-ny-yankees-1024x684.jpg",
        "publishedAt": "2022-12-07T14:37:30Z",
        "content": "The reigning American League MVP isn’t going anywhere. Free-agent outfielder Aaron Judge has agreed to terms on a new contract with the Yankees, reports Jon Morosi of MLB.com. The deal, which is still pending a physical, will guarantee Judge $360MM over a nine-year term, reports Ken Rosenthal of The Athletic. \n It’s the largest free-agent contract in MLB history, handily topping Bryce Harper’s previous $330MM record. The $40MM average annual value on the contract establishes a new record among position players and trails only the matching $43.333MM AAVs of Max Scherzer and Justin Verlander — both of whom are on shorter-term deals — for the largest in MLB history. Judge is represented by Page Odle of PSI Sports Management. \n Judge’s decision to remain in New York puts an end to a weeks-long saga that saw him primarily fixated on the Yankees and Giants, his two most serious suitors from the moment he rejected a qualifying offer issued by the Yankees. The Giants were reported to have made a similar offer yesterday, and Morosi tweets that Judge turned down higher offers after ultimately deciding he preferred to remain a Yankee. The Padres, notably, made a late offer in an attempt to woo Judge, albeit to no avail. Judge will now likely spend his entire career in Yankee pinstripes, as the new contract will run through his age-39 season.",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "NDTV News"
        },
        "author": "NDTV Sports Desk",
        "title": "India vs Bangladesh, 2nd ODI Highlights: Rohit Sharma's Knock In Vein As Bangladesh Beat India To Clinch Series - NDTV Sports",
        "description": "IND vs BAN, 2nd ODI Highlights: Bangladesh beat India by five runs in second ODI to take an unassailable 2-0 lead in three-match series",
        "url": "https://sports.ndtv.com/bangladesh-vs-india-2022-23/india-vs-bangladesh-2nd-odi-match-ind-vs-ban-live-score-updates-3584274",
        "urlToImage": "https://c.ndtvimg.com/2022-12/jjlma6k_rohit-sharma-afp_625x300_07_December_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675",
        "publishedAt": "2022-12-07T14:33:45Z",
        "content": "India vs Bangladesh 2nd ODI Highlights: Rohit Sharma played a quickfire knock of 51 not out, but Bangladesh held their nerves to win the second ODI by 5 runs at the Sher-e-Bangla International Stadiu… [+1233 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "The Athletic"
        },
        "author": "Jake Ciely",
        "title": "Fantasy Football Rankings Week 14: Sleepers, starts, sits | D’Onta Foreman, Chigoziem Okonkwo, worst Christmas songs and more - The Athletic",
        "description": "Jake Ciely helps you get your lineup set for an all-important Week 14, in addition to laying out his Top 10 worst Christmas tracks.",
        "url": "https://theathletic.com/3976050/2022/12/07/fantasy-football-rankings-week-14-sleepers-starts-sits-donta-foreman-chigoziem-okonkwo-worst-christmas-songs/",
        "urlToImage": "https://cdn.theathletic.com/app/uploads/2022/11/25181509/GettyImages-1437749538-1024x683.jpg",
        "publishedAt": "2022-12-07T14:25:47Z",
        "content": "Not only are the fantasy football playoffs nearly here, but so is Christmas. So along with our typical Week 14 rankings, sleepers, and start/sit advice, we have Christmas songs. In case you missed pa… [+7820 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Sky Sports"
        },
        "author": "Sky Sports",
        "title": "James Haskell: England sacking Eddie Jones is madness: \"I can't understand it\" | Grumpy media, miserable fans forced it - Sky Sports",
        "description": "James Haskell has labelled the RFU's decision to sack Eddie Jones as \"utter madness\", saying it was forced by \"grumpy media, miserable fans.\"",
        "url": "https://www.skysports.com/rugby-union/news/12504/12763356/james-haskell-england-sacking-eddie-jones-is-madness-i-cant-understand-it-grumpy-media-miserable-fans-forced-it",
        "urlToImage": "https://e2.365dm.com/22/12/1600x900/skysports-james-haskell-eddie_5989128.jpg",
        "publishedAt": "2022-12-07T14:13:36Z",
        "content": "Please use Chrome browser for a more accessible video player\r\nFormer England back-row James Haskell has called the RFU's decision to sack Eddie Jones as 'utter madness'\r\nFormer England back-row James… [+8175 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": "cnn",
            "name": "CNN"
        },
        "author": "Matias Grez",
        "title": "Could Cristiano Ronaldo be Portugal's super sub for the rest of the World Cup? - CNN",
        "description": "Cristiano Ronaldo has found himself in unfamiliar territory this season -- but no matter where he is in the stadium, the cameras follow.",
        "url": "https://www.cnn.com/2022/12/07/football/cristiano-ronaldo-super-sub-portugal-world-cup-spt-intl/index.html",
        "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221207113650-ronaldo-substitute-tease.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2022-12-07T14:11:00Z",
        "content": "Cristiano Ronaldo has found himself in unfamiliar territory this season but no matter where he is in the stadium, the cameras follow.\r\nAfter it was announced he would start Portugals World Cup round … [+3920 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Eurosport.com AU"
        },
        "author": "James Kilpatrick",
        "title": "England v France: The key battles that could decide the big World Cup 2022 quarter-final clash in Qatar - Eurosport COM",
        "description": "Ahead of England v France on Saturday, we assess three of the key on-pitch battles which may decide the outcome of the World Cup quarter-final.",
        "url": "https://www.eurosport.com/football/world-cup/2022/england-v-france-the-key-battles-that-could-decide-the-big-world-cup-2022-quarter-final-clash-in-qat_sto9262819/story.shtml",
        "urlToImage": "https://i.eurosport.com/2022/12/07/3504396-71435088-2560-1440.jpg",
        "publishedAt": "2022-12-07T14:07:00Z",
        "content": "'I don't want to think about it' - Stones on Southgate leaving England after World Cup\r\n00:01:18",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "The Athletic"
        },
        "author": "Ken Rosenthal, Matt Gelb, Will Sammon",
        "title": "Phillies, Taijuan Walker agree to 4-year, $72M deal: Sources - The Athletic",
        "description": "The 30-year-old right-hander went 12-5 with a 3.49 ERA across 157.1 IP last season.",
        "url": "https://theathletic.com/3977327/2022/12/06/taijuan-walker-phillies-contract-free-agency/",
        "urlToImage": "https://cdn.theathletic.com/app/uploads/2022/12/06211658/Walker-1024x683.jpg",
        "publishedAt": "2022-12-07T14:05:37Z",
        "content": "By Ken Rosenthal, Matt Gelb and Will Sammon\r\nThe Philadelphia Phillies and free-agent pitcher Taijuan Walker have agreed to a four-year, $72 million contract, major-league sources tell The Athletic. … [+3514 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": "cnn",
            "name": "CNN"
        },
        "author": "Jonny Hallam, Abeer Salman",
        "title": "Palestinian flag waved on pitch as Morocco celebrates historic World Cup win - CNN",
        "description": "Several players of Morocco's national team unfurled a Palestinian flag on the pitch while celebrating their historic World Cup win over Spain in Qatar on Tuesday.",
        "url": "https://www.cnn.com/2022/12/07/football/morocco-palestine-world-cup-spt-intl/index.html",
        "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221207034948-morocco-spain-win-palestinian-flag-221206.jpg?c=16x9&q=w_800,c_fill",
        "publishedAt": "2022-12-07T13:56:00Z",
        "content": "Several players of Moroccos national team unfurled a Palestinian flag on the pitch while celebrating their historic World Cup win over Spain in Qatar on Tuesday.\r\nFollowing a dramatic penalty shootou… [+1329 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "The Guardian"
        },
        "author": "Angus Fontaine",
        "title": "Eddie Jones’s England exit could herald a maverick return to Australian rugby - The Guardian",
        "description": "The fiercely-Australian coach is suddenly a free agent with an axe to grind and a World Cup plan – and the Wallabies need a wildcard to win big in 2023",
        "url": "https://www.theguardian.com/sport/2022/dec/07/eddie-joness-england-exit-could-herald-a-maverick-return-to-australian-rugby",
        "urlToImage": "https://i.guim.co.uk/img/media/fb3b09162c6d35585931368543fdf828cf76ce96/0_117_5523_3314/master/5523.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b9e0876f50119072779f98781b4fa3c6",
        "publishedAt": "2022-12-07T13:54:00Z",
        "content": "In sacking Eddie Jones as head coach eight months out from the World Cup, English rugby may have gift-wrapped an early Christmas present for the woebegone Wallabies in 2023. The fiercely-Australian J… [+5182 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Cricketaddictor.com"
        },
        "author": null,
        "title": "India vs Bangladesh Live Match Channel Name, Live Streaming App 2nd ODI: Where To Watch IND vs BAN Live In - Cricket Addictor",
        "description": "India vs Bangladesh Live Match Channel Name, Live Streaming App 2nd ODI: Where To Watch IND vs BAN Live In Your Country? 2nd ODI",
        "url": "https://cricketaddictor.com/india-tour-of-bangladesh-2022/india-vs-bangladesh-live-match-channel-name-live-streaming-app-2nd-odi-where-to-watch-ind-vs-ban-live-in-your-country-2nd-odi/",
        "urlToImage": "https://i0.wp.com/cricketaddictor.com/wp-content/uploads/2022/12/India-vs-Bangladesh-2022.jpeg",
        "publishedAt": "2022-12-07T13:48:13Z",
        "content": "India vs Bangladesh Live Match Channel Name, Live Streaming App 2nd ODI: Where To Watch IND vs BAN Live In Your Country? 2nd ODI.  Bangladesh stunned India in the 1st ODI of the three-match series by… [+4606 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": "bbc-news",
            "name": "BBC News"
        },
        "author": "https://www.facebook.com/bbcnews",
        "title": "Raheem Sterling: Police not linking break-ins in Surrey village - BBC",
        "description": "Police say no arrests have been made in connection with the burglary at Raheem Sterling's home.",
        "url": "https://www.bbc.co.uk/news/uk-england-surrey-63888941",
        "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/3945/production/_127916641_gettyimages-1444789589.jpg",
        "publishedAt": "2022-12-07T13:47:12Z",
        "content": "Police investigating a break-in at the home of England star Raheem Sterling are not linking it to another attempted burglary in the same village.\r\nSurrey Police said earlier it was looking into wheth… [+1115 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Crictracker.com"
        },
        "author": "CricTracker Staff",
        "title": "LPL 2022: Match 4, GG vs KF Match Prediction – Who will win today’s LPL match between GG vs KF? - CricTracker",
        "description": "The Galle Gladiators (GG) will be clashing against Kandy Falcons (KF) in the fourth match of the Lanka Premier League 2022 (LPL) at Mahinda Rajapaksa International Cricket Stadium (MRICS) in Hambantot",
        "url": "https://www.crictracker.com/cricket-match-predictions/lpl-2022-match-4-gg-vs-kf-match-prediction-who-will-win-todays-lpl-match-between-gg-vs-kf/",
        "urlToImage": "https://media.crictracker.com/media/featureimage/Galle-Gladiators-Celebrates.jpg",
        "publishedAt": "2022-12-07T13:45:00Z",
        "content": "The Galle Gladiators (GG) will be clashing against Kandy Falcons (KF) in the fourth match of the Lanka Premier League 2022 (LPL) at Mahinda Rajapaksa International Cricket Stadium (MRICS) in Hambanto… [+2867 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "ESPN"
        },
        "author": "Jesse Rogers",
        "title": "Sources - Cubs, Cody Bellinger reach 1-year, $17.5M deal - ESPN",
        "description": "Outfielder Cody Bellinger, who has struggled for the Dodgers since his 2019 MVP season, has reached a $17.5 million deal with the Cubs, sources told ESPN.",
        "url": "https://www.espn.com/mlb/story/_/id/35198596/sources-cubs-cody-bellinger-reach-1-year-175m-deal",
        "urlToImage": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0816%2Fr1049249_1296x729_16%2D9.jpg",
        "publishedAt": "2022-12-07T13:40:48Z",
        "content": "Outfielder Cody Bellinger and the Chicago Cubs are in agreement on a one-year, $17.5 million contract, sources familiar with the deal told ESPN's Jeff Passan on Tuesday.\r\nThe 27-year-old Bellinger co… [+2467 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "CBS Sports"
        },
        "author": "",
        "title": "Rams claim Baker Mayfield off waivers: Former Panthers QB goes to L.A.; no other team reportedly puts in claim - CBS Sports",
        "description": "The defending champs are adding the former No. 1 overall pick to finish out the season",
        "url": "https://www.cbssports.com/nfl/news/rams-claim-baker-mayfield-off-waivers-former-panthers-qb-goes-to-l-a-no-other-team-puts-in-a-claim/",
        "urlToImage": "https://sportshub.cbsistatic.com/i/r/2022/12/06/e43acd91-4fb7-495c-b0c2-154ac6703586/thumbnail/1200x675/bd1903f7695e86121404b0d9bfb79602/newbaker.jpg",
        "publishedAt": "2022-12-07T13:28:00Z",
        "content": "The Los Angeles Rams are adding a quarterback to their roster, as they have claimed former Carolina Panthers signal-caller Baker Mayfield, per CBS Sports NFL Insider Josina Anderson. The former No. 1… [+2039 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Sportsnet.ca"
        },
        "author": null,
        "title": "Report: Aaron Judge agrees to nine-year, $360M deal with Yankees - Sportsnet.ca",
        "description": "Aaron Judge won the 2022 AL MVP with the Yankees after breaking Roger Maris' record with 62 home runs. The year-old hit .311 with 131 RBI, 16 stolen bases and a league-best 1.111 OPS.",
        "url": "https://www.sportsnet.ca/mlb/article/report-aaron-judge-agrees-to-nine-year-360m-deal-with-yankees/",
        "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2022/12/Judge1-1040x572.jpg",
        "publishedAt": "2022-12-07T13:26:00Z",
        "content": "New York Yankees center fielder Aaron Judge connects for a solo home run during the second inning of Game 5 of an American League Division baseball series against the Cleveland Guardians, Tuesday, Oc… [+47 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "The Guardian"
        },
        "author": "Guardian staff reporter",
        "title": "'I'll miss you': Belgium's Eden Hazard retires from international football - The Guardian",
        "description": "Belgium’s Eden Hazard has announced his retirement from international football after his team’s disappointing group-stage exit at the World Cup",
        "url": "https://www.theguardian.com/football/2022/dec/07/belgium-eden-hazard-retires-from-international-football-real-madrid",
        "urlToImage": "https://i.guim.co.uk/img/media/780fac92debb09f06784433c57abec6dfd8b4672/459_122_2949_1769/master/2949.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0ed8675bcbf1abd995f11bf78cefdaf4",
        "publishedAt": "2022-12-07T13:23:00Z",
        "content": "Eden Hazard has announced his international retirement in the wake of Belgiums group stage exit from the World Cup in Qatar.\r\nThe 31-year-old revealed the decision on his social media account less th… [+903 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "CBS Sports"
        },
        "author": "",
        "title": "Prisco's Week 14 NFL picks: Brock Purdy lifts 49ers over Buccaneers, Chargers upset Dolphins, Bills blast Jets - CBS Sports",
        "description": "Pete Prisco reveals all of his Week 14 NFL picks, including the red-hot Lions knocking off the Vikings",
        "url": "https://www.cbssports.com/nfl/news/priscos-week-14-nfl-picks-brock-purdy-lifts-49ers-over-buccaneers-chargers-upset-dolphins-bills-blast-jets/",
        "urlToImage": "https://sportshub.cbsistatic.com/i/r/2022/12/07/6a956028-be15-442c-af65-4b880ab8655a/thumbnail/1200x675/8b8dd1cee40f6b462e90cfbe10e9beb2/purdy-jpeg.jpg",
        "publishedAt": "2022-12-07T13:07:27Z",
        "content": "Who says 13 is an unlucky number? Week 13 sure wasn't unlucky for me. It wasn't quite the triple-crown hit I wanted, but it was close.\r\nI went 10-5 in my ATS expert picks, 11-3-1 straight up and 3-3 … [+4847 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Eurosport.com AU"
        },
        "author": "Eurosport",
        "title": "Declan Rice misses England training through illness ahead of France clash in World Cup 2022 quarter-final - Eurosport COM",
        "description": "Declan Rice missed England's training session on Wednesday due to illness.",
        "url": "https://www.eurosport.com/football/world-cup/2022/declan-rice-misses-england-training-through-illness-ahead-of-france-clash-in-world-cup-2022-quarter-_sto9262791/story.shtml",
        "urlToImage": "https://i.eurosport.com/2022/12/07/3504347-71434108-2560-1440.jpg",
        "publishedAt": "2022-12-07T12:56:00Z",
        "content": "'I don't want to think about it' - Stones on Southgate leaving England after World Cup\r\n00:01:18",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Sportskeeda"
        },
        "author": "Kyle Dimond",
        "title": "“I'm coming for all the belts” - Anatoly Malykhin is targeting Reinier de Ridder’s middleweight strap next - Sportskeeda",
        "description": "Across ONE’s back-to-back events in Manila this past weekend, it was Anatoly Malykhin who stole the headlines with his performance.",
        "url": "https://www.sportskeeda.com/mma/news-i-m-coming-belts-anatoly-malykhin-targeting-reinier-de-ridder-s-middleweight-strap-next",
        "urlToImage": "https://staticc.sportskeeda.com/editor/2022/12/4188e-16704180998527-1920.jpg",
        "publishedAt": "2022-12-07T12:55:00Z",
        "content": "Across ONEs back-to-back events in Manila this past weekend, it was Anatoly Malykhin who stole the headlines with his performance.\r\nIn the main event of ONE on Prime Video 5, the interim heavyweight … [+3179 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "The Guardian"
        },
        "author": "Guardian staff reporter",
        "title": "Michael O’Neill ‘delighted’ to make return as Northern Ireland manager - The Guardian",
        "description": "Michael O’Neill has been appointed Northern Ireland manager a little over two and a half years after leaving the post for Stoke",
        "url": "https://www.theguardian.com/football/2022/dec/07/michael-oneill-delighted-to-make-return-as-northern-ireland-manager",
        "urlToImage": "https://i.guim.co.uk/img/media/efbbdca11cdc928ebd6742597ebc1da18b21a6f1/38_32_3343_2007/master/3343.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=617614cf412492fa13b100f7309cb3c1",
        "publishedAt": "2022-12-07T12:47:00Z",
        "content": "Michael ONeill has been reappointed as Northern Irelands manager a little over two and a half years after leaving the post for Stoke.\r\nONeill has signed a five-and-a-half-year contract which will run… [+2424 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Daily Mail"
        },
        "author": "Ben Willcocks",
        "title": "Cristiano Ronaldo 'has NOT trained' with Portugal's other last-16 substitutes today - Daily Mail",
        "description": "Cristiano Ronaldo did not train with Portugal's substitutes on Wednesday and instead insisted on joining the Fernando Santos' starters for a gym session, according to reports in Spain.",
        "url": "https://www.dailymail.co.uk/sport/football/article-11512259/Cristiano-Ronaldo-trained-Portugals-16-substitutes-TODAY-reports-claim.html",
        "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/07/12/65336847-0-image-a-37_1670417217259.jpg",
        "publishedAt": "2022-12-07T12:46:28Z",
        "content": "Cristiano Ronaldo did not train with Portugal's substitutes on Wednesday and instead insisted on joining the starters for a gym session, according to reports in Spain.\r\nThe 37-year-old was axed by Po… [+3580 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Sky Sports"
        },
        "author": null,
        "title": "Declan Rice: England midfielder out of training with illness just three days before World Cup quarter-final with France - Sky Sports",
        "description": "England midfielder Declan Rice was absent from training on Wednesday due to illness, just three days before the Three Lions' World Cup quarter-final with France.",
        "url": "https://www.skysports.com/football/news/11095/12763394/declan-rice-england-midfielder-out-of-training-with-illness-just-three-days-before-world-cup-quarter-final-with-france",
        "urlToImage": "https://e0.365dm.com/22/11/1600x900/skysports-england-usa-world-cup_5978353.jpg?20221125210614",
        "publishedAt": "2022-12-07T12:33:45Z",
        "content": "England midfielder Declan Rice was absent from training on Wednesday due to illness, just three days before the Three Lions' World Cup quarter-final with France.\r\nThe midfielder has started every gam… [+2897 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "ESPN"
        },
        "author": "Chris Low, Andrea Adelson",
        "title": "Peyton Manning Charles Woodson Heisman title conspiracies - ESPN",
        "description": "Why Tennessee fans think Charles Woodson stole the Heisman from Peyton Manning and why Michigan fans blame Tennessee for a shared title with Nebraska.",
        "url": "https://www.espn.com/college-football/story/_/id/35181627/peyton-manning-charles-woodson-heisman-title-conspiracies",
        "urlToImage": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F1205%2Fncf_1997%2Dconspiracy%2Dtheories_16x9.jpg",
        "publishedAt": "2022-12-07T12:28:45Z",
        "content": "KNOXVILLE, Tenn. -- On the back wall of Gus' Good Times Deli, an iconic eatery on the University of Tennessee campus, hangs an oversized banner that has been in place for at least two decades and ser… [+20746 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": "news24",
            "name": "News24"
        },
        "author": "Sibusiso Mjikeliso",
        "title": "WATCH | Bulls explain 21-day Sbu Nkosi search after fielding criticism - News24",
        "description": "Bulls CEO Edgar Rathbone said they had to juggle safety concerns and manage the player's reputation during their 21-day search for Sbu Nkosi.",
        "url": "https://www.news24.com/sport/rugby/unitedrugbychampionship/watch-bulls-explain-21-day-sbu-nkosi-search-after-fielding-criticism-20221207",
        "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2932/0c12c2d0491642aa9c138c3bbfb91a6b.jpg",
        "publishedAt": "2022-12-07T12:26:42Z",
        "content": "<ul><li>Bulls CEO Edgar Rathbone said they had to juggle safety concerns and manage the player's reputation during their 21-day search for Sbu Nkosi.</li><li>The Springbok was located at his father's… [+3719 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": "marca",
            "name": "Marca"
        },
        "author": "M.C.",
        "title": "Shaquille O'Neal shoved into a giant Christmas tree by Kenny Smith live on TV - Marca English",
        "description": "Things got competitive on &apos;NBA on TNT&apos; when analyst Kenny Smith raced Shaquille O&apos;Neal to the main screen on the set.  \n\nThe pair had been debating over who was the",
        "url": "https://www.marca.com/en/basketball/nba/2022/12/07/6390833546163f20b08b458b.html",
        "urlToImage": "https://ak.uecdn.es/p/110/thumbnail/entry_id/0_4g59hbc4/width/657/type/2/bgcolor/000000/0_4g59hbc4.jpg",
        "publishedAt": "2022-12-07T12:13:10Z",
        "content": "Things got competitive on 'NBA on TNT' when analyst Kenny Smith raced Shaquille O'Neal to the main screen on the set. \r\nThe pair had been debating over who was the quickest, and decided to put the de… [+624 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Independent.ie"
        },
        "author": "Jamie Gardner",
        "title": "Police investigate possible links between arrests and Raheem Sterling burglary - Independent.ie",
        "description": "Surrey Police are investigating whether there is any link between the arrest of two men on Tuesday night on suspicion of attempted burglary and Saturday&rsquo;s report of a break-in at the home of England star Raheem Sterling.",
        "url": "https://www.independent.ie/world-news/europe/britain/police-investigate-possible-links-between-arrests-and-raheem-sterling-burglary-42201941.html",
        "urlToImage": "https://www.independent.ie/world-news/europe/britain/da946/42201939.ece/AUTOCROP/w1240h700/69957217",
        "publishedAt": "2022-12-07T12:12:00Z",
        "content": "Surrey Police are investigating whether there is any link between the arrest of two men on Tuesday night on suspicion of attempted burglary and Saturdays report of a break-in at the home of England s… [+1793 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Olympics.com"
        },
        "author": "Shintaro Kano",
        "title": "Badminton, BWF World Tour Finals 2022: Results & live scores and updates - day one featuring Axelsen, Prannoy, Ginting, Christie, Loh, Yufei, Seyoung and Yamaguchi - Olympics",
        "description": "Live updates from the first day of action at badminton's World Tour Finals in Bangkok, Thailand, on Wednesday 7 December 2022.",
        "url": "https://olympics.com/en/news/bwf-badminton-world-tour-finals-2022-live-day-1",
        "urlToImage": "https://img.olympicchannel.com/images/image/private/t_social_share_thumb/f_auto/primary/lfk5h4uafkao2suvnfdr",
        "publishedAt": "2022-12-07T12:07:00Z",
        "content": "Badminton's grand season finale, the BWF World Tour Finals 2022 are under way in Bangkok, Thailand.\r\nGroup action involving the tour's top eight players/pairs across the five events of men's singles,… [+5053 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "The Guardian"
        },
        "author": "Guardian staff reporter",
        "title": "Manchester United have moved on from Cristiano Ronaldo, insists Erik ten Hag - The Guardian",
        "description": "Erik ten Hag insists Manchester United have moved on from Cristiano Ronaldo’s messy departure last month",
        "url": "https://www.theguardian.com/football/2022/dec/07/manchester-united-have-moved-on-from-cristiano-ronaldo-insists-erik-ten-hag",
        "urlToImage": "https://i.guim.co.uk/img/media/cd39b3743dfda3fa106391b36d6afe79e73615b0/0_16_1460_876/master/1460.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2da96ff3908733c6fff09b764434f0db",
        "publishedAt": "2022-12-07T12:07:00Z",
        "content": "Erik ten Hag insists Manchester United have moved on from Cristiano Ronaldos messy departure from the club last month.\r\nTen Hag was not willing to discuss the saga in depth when asked by the clubs in… [+1562 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Mirror Online"
        },
        "author": "Donagh Corby",
        "title": "Boxing legend Manny Pacquiao breaks his silence on refereeing cheating scandal - The Mirror",
        "description": "Referee Carlos Padilla admitted in a recent interview that during his final bout, he cheated to allow Manny Pacquiao the opportunity to win a fight against Nedal Hussein",
        "url": "https://www.mirror.co.uk/sport/boxing/manny-pacquiao-referee-cheating-news-28675136",
        "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article28600400.ece/ALTERNATES/s1200/0_Untitled-1.jpg",
        "publishedAt": "2022-12-07T12:04:40Z",
        "content": "Manny Pacquiao has declared his innocence amid a recent cheating scandal surrounding his 2000 fight with Australian Nedal Hussein. \r\nThe legendary multiple-weight world champion faced Hussein in his … [+3626 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Daily Mail"
        },
        "author": "Charlotte Daly",
        "title": "Bukayo Saka sheepishly asks for a photo with David Beckham - Daily Mail",
        "description": "England fans have called for Bukayo Saka to be protected 'at all costs' after a video emerged of him sheepishly asking David Beckham for a photo out in Qatar.",
        "url": "https://www.dailymail.co.uk/sport/football/article-11512007/Bukayo-Saka-sheepishly-asks-photo-David-Beckham.html",
        "urlToImage": "https://i.dailymail.co.uk/1s/2022/12/07/12/65335897-0-image-a-22_1670415435517.jpg",
        "publishedAt": "2022-12-07T12:02:05Z",
        "content": "England fans have called for Bukayo Saka to be protected 'at all costs' after a video emerged of him sheepishly asking David Beckham for a photo out in Qatar. \r\nBeckham visited England's training cam… [+2895 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Sports Interactive Network Philippines"
        },
        "author": null,
        "title": "PBA News: Ginebra beats NorthPort in Game One of quarterfinal series - Sports Interactive Network Philippines",
        "description": "No surprises in this PBA playoff",
        "url": "https://www.spin.ph/basketball/pba/ginebra-beats-northport-in-game-one-of-quarterfinal-series-a795-20221207",
        "urlToImage": "http://contents.spin.ph/image/resize/image/2022/12/07/japeth-aguilar-northport-ascano-2-1670413717.webp",
        "publishedAt": "2022-12-07T11:57:28Z",
        "content": "BARANGAY Ginebra moved one win away from advancing to the semifinals after a business-like 118-102 victory over an overmatched NorthPort side on Wednesday in the PBA Commissioner’s Cup at the Philspo… [+1918 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Hindustan Times"
        },
        "author": "HT Sports Desk",
        "title": "Why Kohli opened for India ahead of captain Rohit in 2nd ODI vs Bangladesh - Hindustan Times",
        "description": "Former Indian skipper Virat Kohli opened the innings for the Rohit Sharma-led side in the 2nd ODI against Bangladesh on Wednesday. | Cricket",
        "url": "https://www.hindustantimes.com/cricket/why-virat-kohli-opened-for-india-ahead-of-captain-rohit-sharma-in-2nd-india-vs-bangladesh-odi-101670411003215.html",
        "urlToImage": "https://images.hindustantimes.com/img/2022/12/07/1600x900/Collage_Maker-07-Dec-2022-0522-PM_1670413986123_1670413986318_1670413986318.jpg",
        "publishedAt": "2022-12-07T11:54:23Z",
        "content": "Former Indian skipper Virat Kohli swapped places with Rohit Sharma in India's formidable batting order when the Asian giants squared off against Bangladesh on Wednesday. After suffering an embarrassi… [+1792 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": "talksport",
            "name": "TalkSport"
        },
        "author": "Jake Lambourne",
        "title": "The fixtures Arsenal striker Gabriel Jesus could miss after knee surgery including Newcastle, Tottenham... - talkSPORT",
        "description": "",
        "url": "https://talksport.com/football/1265701/arsenal-gabriel-jesus-fixtures-miss-knee-injury/",
        "urlToImage": "https://talksport.com/wp-content/uploads/sites/5/2022/12/gabriel-jesus-brazil-looks-fifa-780087101.jpg?crop=77px%2C42px%2C2502px%2C1666px&resize=1920%2C1080",
        "publishedAt": "2022-12-07T11:45:10Z",
        "content": "Gabriel Jesus is set to miss a number of crucial games for Arsenal after undergoing knee surgery which could keep him out for three months.\r\nThe 25-year-old was ruled out of the World Cup last week a… [+4491 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Mirror Online"
        },
        "author": "Colin Millar",
        "title": "Man Utd face Joao Felix transfer blow as 'talks underway' with Premier League rivals - The Mirror",
        "description": "Joao Felix is set to leave Atletico Madrid in the January transfer window and is linked with Manchester United, but Aston Villa have opened negotiations to sign him",
        "url": "https://www.mirror.co.uk/sport/football/transfer-news/joao-felix-atletico-man-united-28674884",
        "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article28638989.ece/ALTERNATES/s1200/0_TOPSHOT-FBL-WC-2022-MATCH15-POR-GHA.jpg",
        "publishedAt": "2022-12-07T11:40:25Z",
        "content": "Aston Villa have reportedly opened negotiations with Atletico Madrid to sign wantaway forward Joao Felix in January. \r\n Felix, 23, has started just five of Atletis 14 La Liga matches this campaign an… [+2514 chars]",
        "category": "sports"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Paul Tassi",
        "title": "‘Destiny 2’ Has Secretly Buffed Crafting Pattern Drop Rates For Season Of The Seraph - Forbes",
        "description": "One day, thirteen red frame Deepsight weapon crafting patterns. Yes, I am now willing to declare that Bungie has quietly buffed the drop rates for Destiny 2 Deepsight weapons for Season of the Seraph, in addition to giving players more chances to get them det…",
        "url": "https://www.forbes.com/sites/paultassi/2022/12/07/destiny-2-has-secretly-buffed-crafting-pattern-drop-rates-for-season-of-the-seraph/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6390a24108558512ba7d7557/0x0.jpg?format=jpg&width=1200",
        "publishedAt": "2022-12-07T14:34:38Z",
        "content": "One day, thirteen red frame Deepsight weapon crafting patterns. Yes, I am now willing to declare that Bungie has quietly buffed the drop rates for Destiny 2 Deepsight weapons for Season of the Seraph, in addition to giving players more chances to get them deterministically, and earlier in the season. \n The crafting grind, needing to get 5 patterns on a weapon in order to unlock the ability to craft it, has been one of the most exhausting parts of the past few seasons since it was introduced. But while Bungie has laid out broader changes coming in the future, like additional ways to earn Deepsight currency, they did not announce what appears to be the biggest change of all, a buff to drop rates. \n Playing the season launch yesterday I did in fact earn 13 different weapon patterns across the reprised IKELOS and new Seraph seasonal weapons. Have I been playing for 24 hours non-stop? No. Here’s what I did: \n *  The intro story mission and initial Heist Battleground on three characters. \n * Doing 5-6 Resonance Amp hunts to find music boxes until I got one copy of all four IKELOS weapons. \n * Free-focusing Umbral engrams into IKELOS weapons using stems. \n * Six looted clears of the Heist Battlegrounds’ final chest in the playlist. \n * Getting engrams from Clovis through some rep ranks. \n That’s it. I literally already have 4/5 on the new glaive after just a few hours of play on day one. That’s a marked change from past seasons, as I’ve never, ever gotten this many pattern drops this quickly. What I am not sure about if this is a broader change to all drop rates on red border weapons (Dares of Eternity, raids), as I haven’t run those yet, but I’ve heard it may be.",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Phys.Org"
        },
        "author": "Science X staff",
        "title": "Synthesis of material that absorbs electromagnetic waves in the 6G band - Phys.org",
        "description": "A research team led by Dr. Youn-kyoung Baek and Dr. Jung-goo Lee succeeded in developing the world's first technology to consecutively manufacture epsilon iron oxide that can absorb millimeter wave with a high coercive force equivalent to that of neodymium (N…",
        "url": "https://phys.org/news/2022-12-synthesis-material-absorbs-electromagnetic-6g.html",
        "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/tech-to-absorb-electro.jpg",
        "publishedAt": "2022-12-07T14:33:00Z",
        "content": "A research team led by Dr. Youn-kyoung Baek and Dr. Jung-goo Lee succeeded in developing the world's first technology to consecutively manufacture epsilon iron oxide that can absorb millimeter wave with a high coercive force equivalent to that of neodymium (Nd) magnets. The researchers are from the Department of Magnetic Materials in Powder Materials Division at the Korea Institute of Materials Science (KIMS), a research institute under the Ministry of Science and ICT. \n  Iron oxide material with a high-coercive epsilon crystal phase is almost the only magnetic material that absorbs ultra-high frequencies, which is a potential 6G frequency band. Until now, it was only formed in a nano-sized particle of 50 nanometers or less. Researchers in Japan succeeded in producing pure epsilon iron oxide through a batch type wet process, but this involves time consuming multi-stage process, resulting in a low yield.",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "RadioTimes"
        },
        "author": "Toby Saunders",
        "title": "Overwatch 2 Twitch drops: How to get Monk Ramattra skin - Radio Times",
        "description": "A happy monk.",
        "url": "https://www.radiotimes.com/technology/gaming/overwatch-2-twitch-drops/",
        "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/3/2022/12/Overwatch-2-Twitch-drops-034f0b7.jpg?resize=620,413",
        "publishedAt": "2022-12-07T14:30:24Z",
        "content": "Following the launch of its second season, players can make the most of Overwatch 2 Twitch drops to unlock nifty new items, including the Monk Ramattra skin. These limited-time drops will be going on… [+3436 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": "engadget",
            "name": "Engadget"
        },
        "author": "https://www.engadget.com/about/editors/jon-fingas",
        "title": "Microsoft Teams takes on Facebook groups with community hubs - Engadget",
        "description": "Microsoft Teams now has community hubs that let you organize your local sports team or carpooling group..",
        "url": "https://www.engadget.com/microsoft-teams-communities-141514818.html",
        "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-12/d677f9b0-7633-11ed-aff1-1b72f9dbe82f",
        "publishedAt": "2022-12-07T14:16:23Z",
        "content": "Microsoft Teams is now useful for organizing more than just your company meetings. Microsoft has introduced a communities feature on Android and iOS that effectively offers an alternative to Facebook… [+1274 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Yahoo Entertainment"
        },
        "author": "Jon Fingas",
        "title": "Microsoft Teams takes on Facebook groups with community hubs - Yahoo Finance Australia",
        "description": "Microsoft Teams now has community hubs that let you organize your local sports team or carpooling group.",
        "url": "https://au.news.yahoo.com/microsoft-teams-communities-141514818.html",
        "urlToImage": "https://s.yimg.com/ny/api/res/1.2/Y43Ulf6MS7MNXexElwtpMg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2022-12/d677f9b0-7633-11ed-aff1-1b72f9dbe82f",
        "publishedAt": "2022-12-07T14:15:14Z",
        "content": "Microsoft Teams is now useful for organizing more than just your company meetings. Microsoft has introduced a communities feature on Android and iOS that effectively offers an alternative to Facebook… [+1274 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Nintendo Life"
        },
        "author": "Jim Norman",
        "title": "Atari Announces Ultra Rare Arcade Shooter 'Akka Arrh' Is Coming To Switch - Nintendo Life",
        "description": "Originally scrapped for being \"too difficult\"",
        "url": "https://www.nintendolife.com/news/2022/12/atari-announces-ultra-rare-arcade-shooter-akka-arrh-is-coming-to-switch",
        "urlToImage": "https://images.nintendolife.com/5177bf66ca986/1280x720.jpg",
        "publishedAt": "2022-12-07T14:15:00Z",
        "content": "Subscribe to Nintendo Life on YouTube\r\nAfter Atari 50: The Anniversary Celebration, Atari Flashback Classics and Atari Mania, you might think that the iconic studio would want a break from looking in… [+2611 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "TechNave"
        },
        "author": "Henry Kwan",
        "title": "Telegram now allows users to create accounts without a SIM card - TechNave",
        "description": "You can now sign up for a&nbsp;Telegram&nbsp;account without having a SIM card. The social media platform&nbsp;announced&nbsp;the feature through an official bl",
        "url": "https://technave.com/gadget/Telegram-now-allows-users-to-create-accounts-without-a-SIM-card-32697.html",
        "urlToImage": "https://technave.com/data/files/article/202212071404426657.jpg",
        "publishedAt": "2022-12-07T14:09:40Z",
        "content": "You can now sign up for a Telegram account without having a SIM card. The social media platform announced the feature through an official blog post, but there's a catch.\r\nThe messaging platform didn'… [+1169 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Sportskeeda"
        },
        "author": "Mridul Dutta",
        "title": "Will Smuggler’s Sell Missions in GTA Online be worth doing after the winter update? - Sportskeeda",
        "description": "GTA Online will receive a winter update on December 8, 2022, and Rockstar Games has announced a slew of deals, offers, and quality-of-life changes via its newswire.",
        "url": "https://www.sportskeeda.com/gta/will-smuggler-s-sell-missions-gta-online-worth-winter-update",
        "urlToImage": "https://staticg.sportskeeda.com/editor/2022/12/13f4f-16704140275933-1920.jpg",
        "publishedAt": "2022-12-07T14:07:37Z",
        "content": "GTA Online will receive a winter update on December 8, 2022, and Rockstar Games has announced a slew of deals, offers, and quality-of-life changes via its newswire. While many other unannounced featu… [+3231 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Barron's"
        },
        "author": "Adam Clark",
        "title": "Microsoft Offers to Bring Activision’s ‘Call of Duty’ to Nintendo Switch - Barron's",
        "description": "Microsoft is seeking to address antitrust concerns over its planned $75 billion purchase of Activision Blizzard.",
        "url": "https://www.barrons.com/articles/microsoft-sony-activision-nintendo-call-of-duty-51670421852",
        "urlToImage": "https://images.barrons.com/im-333781/social",
        "publishedAt": "2022-12-07T14:06:00Z",
        "content": "Microsoft\r\nwhich is trying to buy videogame developer \r\nActivision Blizzard\r\nhas pledged to give rival \r\nNintendo\r\naccess to the blockbuster franchise Call of Duty for a decade as it tries to assuage… [+503 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "India TV News"
        },
        "author": "Reported by IANS, Edited by Saumya Nigam",
        "title": "WhatsApp Update: Mark Zuckerberg brings digital avatars for users - India TV News",
        "description": "Your avatar is a digital version of you, created from billions of combinations of diverse hairstyles, facial features and outfits. Meta said that it will continue to deliver style enhancements including lighting, shading, hair-style textures, and more in the …",
        "url": "https://www.indiatvnews.com/technology/news/whatsapp-update-mark-zuckerberg-brings-digital-avatars-for-users-2022-12-07-829417",
        "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/12/whatsapp-pixabay-2-1670421612.jpg",
        "publishedAt": "2022-12-07T14:01:16Z",
        "content": "Meta Founder and CEO Mark Zuckerberg have announced that the company is going to bring digital avatars to the WhatsApp platform now.\r\nOn WhatsApp, people can now use their personalised avatars as pro… [+1281 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Fortress of Solitude"
        },
        "author": "Megan Oosthuizen",
        "title": "God of War Ragnarok Photo Mode Is Helping Fans Discover New Details - Fortress of Solitude",
        "description": "Sony Santa Monica studio has shown us time and time again that they are an impeccable game-creating studio and that they will go to great lengths to",
        "url": "https://www.fortressofsolitude.co.za/god-of-war-ragnarok-photo-mode-is-helping-fans-discover-new-details/",
        "urlToImage": "https://www.fortressofsolitude.co.za/wp-content/uploads/2022/12/God-of-War-Ragnarok-Photo-Mode-1.jpeg",
        "publishedAt": "2022-12-07T14:00:13Z",
        "content": "Sony Santa Monica studio has shown us time and time again that they are an impeccable game-creating studio and that they will go to great lengths to create some of the greatest games possible. Year a… [+2723 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Digital Trends"
        },
        "author": "Phil Nickinson",
        "title": "Amazon Echo Show 15 is getting the full Fire TV update today - Digital Trends",
        "description": "The Amazon Echo Show 15 is getting a software update that nearly turns the wall-mounted screen into a full Fire TV device.",
        "url": "https://www.digitaltrends.com/home-theater/amazon-echo-show-15-is-getting-the-full-fire-tv-update-today/",
        "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/12/fire-tv-echo-show-15.jpg?p=1",
        "publishedAt": "2022-12-07T14:00:06Z",
        "content": "The line between the Amazon Echo Show 15 and a Fire TV is blurring, with the former getting the experience of the latter starting today with a software update.\r\nIt won’t quite turn your Echo Show 15 … [+1748 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "PRNewswire"
        },
        "author": null,
        "title": "GigFinesse Announces Seed Funding to Connect Venues and Artists and Reimagine The Future of Live Entertainment - PR Newswire",
        "description": "/PRNewswire/ -- GigFinesse, the leading platform that connects live music venues with artists, today announced a $3.6m seed funding round from investors...",
        "url": "https://www.prnewswire.com/news-releases/gigfinesse-announces-seed-funding-to-connect-venues-and-artists-and-reimagine-the-future-of-live-entertainment-301696824.html",
        "urlToImage": "https://mma.prnewswire.com/media/1963256/GFL_Logo.jpg?p=facebook",
        "publishedAt": "2022-12-07T14:00:00Z",
        "content": "The platform closed a seed funding round of $3.6m from investors including Bessemer Venture Partners and Cosmic Venture Partners\r\nNEW YORK, Dec. 7, 2022 /PRNewswire/ -- GigFinesse, the leading platfo… [+4231 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "TechHive"
        },
        "author": "Jared Newman",
        "title": "Tested: Fire TV on the Echo Show 15 - TechHive",
        "description": "Fire TV mode on the Echo Show 15 is a nice upgrade, but most people should probably just buy a TV.",
        "url": "https://www.techhive.com/article/1427475/fire-tv-on-the-echo-show-15.html",
        "urlToImage": "https://www.techhive.com/wp-content/uploads/2022/12/firetvecho15hero.jpg?quality=50&strip=all&w=1024",
        "publishedAt": "2022-12-07T14:00:00Z",
        "content": "Skip to contentType your search and hit enter\r\nWhen you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence\r\n.\r\nAfter announcing Fir… [+6976 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Nintendo Life"
        },
        "author": "Jim Norman",
        "title": "'90s-Inspired Platformer Clive 'N' Wrench Lands New Festive Trailer And US Physical Release Date - Nintendo Life",
        "description": "Alongside its European launch",
        "url": "https://www.nintendolife.com/news/2022/12/90s-inspired-platformer-clive-n-wrench-lands-new-festive-trailer-and-us-physical-release-date",
        "urlToImage": "https://images.nintendolife.com/13c564e18e0df/1280x720.jpg",
        "publishedAt": "2022-12-07T14:00:00Z",
        "content": "Subscribe to Nintendo Life on YouTube\r\nWe were excited to hear that the long-awaited retro platformer Clive 'N' Wrench would be finally hopping its way to Switch in Europe in February 2023, and we ar… [+1890 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": "wired",
            "name": "Wired"
        },
        "author": "Swapna Krishna",
        "title": "In 2022, Picking a Game of the Year Is Ridiculous - WIRED",
        "description": "The ritual of pitting starkly different games against each other has outlived its usefulness.",
        "url": "https://www.wired.com/story/no-more-game-of-the-year/",
        "urlToImage": "https://media.wired.com/photos/638faf304ea975d4889a944a/191:100/w_1280,c_limit/Casual-Gamer-Game-of-the-Year-Horizon-Forbidden-West-Culture.jpg",
        "publishedAt": "2022-12-07T14:00:00Z",
        "content": "In gaming circles, GOTY is a well-recognized acronym. Its the crown jewel of gaming accomplishments, the proclamation that something is the Game of the Year. Most people who play video games use it a… [+3751 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Nintendo Life"
        },
        "author": "Kate Gray",
        "title": "Disney Dreamlight Valley: How To Make Fruitcake - Nintendo Life",
        "description": "You loaf to see it",
        "url": "https://www.nintendolife.com/guides/disney-dreamlight-valley-how-to-make-fruitcake",
        "urlToImage": "https://images.nintendolife.com/d752ec2b73bcf/1280x720.jpg",
        "publishedAt": "2022-12-07T14:00:00Z",
        "content": "Image: Nintendo Life\r\nWe're not massive fruitcake fans here at the Disney Dreamlight Valley guides factory, but you have to admit they do look pretty. But how do you make Fruitcake in Disney Dreamlig… [+1273 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": "techcrunch",
            "name": "TechCrunch"
        },
        "author": "Ivan Mehta",
        "title": "Telegram is auctioning phone numbers to let users sign up to the service without any SIM - TechCrunch",
        "description": "Telegram is auctioning virtual numbers on blockchain, which could be used to sign up for the service without a SIM.",
        "url": "https://techcrunch.com/2022/12/07/telegram-is-auctioning-phone-numbers-to-let-users-sign-up-to-the-service-without-any-sim/",
        "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/12/GettyImages-1229893791.jpg?resize=1200,800",
        "publishedAt": "2022-12-07T13:52:03Z",
        "content": "After putting unique usernames on the auction on the TON blockchain, Telegram is now putting anonymous numbers up for bidding. These numbers could be used to sign up for Telegram without needing any … [+1432 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Nintendo Life"
        },
        "author": "Alana Hagues",
        "title": "Pokémon Scarlet & Violet: How To Unlock 6-Star Raids - Nintendo Life",
        "description": "Star Raids for some Star Bucks",
        "url": "https://www.nintendolife.com/guides/pokemon-scarlet-and-violet-how-to-unlock-6-star-raids",
        "urlToImage": "https://images.nintendolife.com/61a32647494bb/1280x720.jpg",
        "publishedAt": "2022-12-07T13:51:47Z",
        "content": "Image: The Pokémon Company\r\nIf you're someone who thinks Pokémon Scarlet and Violet is a bit too easy, then you should seek out 6-Star Raids. These Tera Raids are the game's most difficult challenge,… [+2878 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Kyodonews.net"
        },
        "author": "",
        "title": "2 ex-Square Enix employees rearrested over insider trading - Kyodo News Plus",
        "description": "Kyodo News Plus is an online publication delivering the latest news from Japan together with those stories from around the globe in which Japan plays a key role. Centering on content provided by Kyodo News, Japan&rsquo;s leading news agency, our publication k…",
        "url": "https://english.kyodonews.net/",
        "urlToImage": "https://english.kyodonews.net/en/img/fb_og_image.png",
        "publishedAt": "2022-12-07T13:45:47Z",
        "content": "Football: Japan's World Cup stars return home to heroes' welcome\r\nJapan's national team returned home Wednesday having surprised the world with group-stage wins over Germany and Spain in soccer's Wor… [+1377 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Digital Trends"
        },
        "author": "Tushar Mehta",
        "title": "This free Android app gave my phone cloning superpowers - Digital Trends",
        "description": "Want to run two WhatsApp, Facebook, or any other accounts from one phone? This app gives you the maximum liberty to run dual apps on any Android device.",
        "url": "https://www.digitaltrends.com/mobile/dual-clone-apps-android-phone-island-great-why/",
        "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/11/Island-dual-apps-e1669227221327.jpg?p=1",
        "publishedAt": "2022-12-07T13:30:02Z",
        "content": "Today, we look at an Android app that lets you run two instances of the same app completely isolated from each other. Whether it’s to ensure that one Android app doesn’t read data from the other, hav… [+6964 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Nintendo Life"
        },
        "author": "Alana Hagues",
        "title": "Mario Kart 8 Deluxe Booster Course Pass Wave 3 Is Out Now With New Custom Items Update - Nintendo Life",
        "description": "Play online your way",
        "url": "https://www.nintendolife.com/news/2022/12/mario-kart-8-deluxe-booster-course-pass-wave-3-is-out-now-with-new-custom-items-update",
        "urlToImage": "https://images.nintendolife.com/3ef22ec22b7c6/1280x720.jpg",
        "publishedAt": "2022-12-07T13:30:00Z",
        "content": "Image: Nintendo\r\nMario Kart 8 Deluxe just keeps getting bigger, and Wave 3 of the Booster Course Pass has just dropped!\r\nAs with every new DLC, two new Cups have been introduced to the mix the Rock C… [+1621 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "ZDNet"
        },
        "author": "Danny Palmer",
        "title": "Android security update fixes more than 80 security vulnerabilities - including four critical - ZDNet",
        "description": "Google's Android Security Bulletin for December 2022 protects against a number of vulnerabilities - including one which could allow attackers to exploit Bluetooth.",
        "url": "https://www.zdnet.com/article/android-security-update-fixes-more-than-80-security-vulnerabilities-including-four-critical/",
        "urlToImage": "https://www.zdnet.com/a/img/resize/0038dae6ee18fa58c1b557a3a261d9af322c50b4/2022/10/21/ab200d82-758e-4826-8e3b-4c6625bc5266/a-woman-looking-at-her-smartphone.jpg?auto=webp&fit=crop&height=675&width=1200",
        "publishedAt": "2022-12-07T13:22:38Z",
        "content": "Image: Getty/Guido Mieth\r\nAndroid's December security update fixes over 80 security vulnerabilities affecting smartphones including four flaws classed as critical. \r\nAccording to Google's Android sec… [+2306 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "The Indian Express"
        },
        "author": "Tech Desk",
        "title": "Sony launches WF-LS900N earbuds: Check price, feature and other details - The Indian Express",
        "description": "The Sony WF-LS900N wireless can automatically switch between transparency mode and active noise cancellation depending on the noise in the surrounding area.",
        "url": "https://indianexpress.com/article/technology/gadgets/sony-launches-wf-ls900n-earbuds-check-price-feature-and-other-details-8311395/",
        "urlToImage": "https://images.indianexpress.com/2022/12/Sony-LinkBuds-S-WF-LS900N.jpeg",
        "publishedAt": "2022-12-07T13:21:53Z",
        "content": "Sony recently added another product to its existing wireless earbud lineup. The latest from Sony is the WF-LS900N,  which weighs a mere 4,8 grams and is designed for those looking for a comfortable p… [+1307 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Livemint"
        },
        "author": "Livemint",
        "title": "Jio's True 5G service tested on Infinix Hot 20 5G: All details here | Mint - Mint",
        "description": "These lab tests confirmed that the Infinix Hot 20 5G could deliver 1.2Gbps of network speed on the Jio True 5G network. The smartphone from Infinix comes with 12 major bands to manage connectivity across several locations. Moreover, other smartphones from Inf…",
        "url": "https://www.livemint.com/technology/tech-news/jios-true-5g-service-tests-on-infinix-hot-20-5g-all-details-here-11670418185907.html",
        "urlToImage": "https://images.livemint.com/img/2022/12/07/600x338/PTI10-01-2022-000115B-0_1664686157879_1664686157879_1670418388399_1670418388399.jpg",
        "publishedAt": "2022-12-07T13:09:27Z",
        "content": "Infinix has recently launched its Hot 20 5G smartphone in India. Now, the company has collaborated with Jio, a telecom giant, to provide True 5G trials on the 20 5G smartphone. This Infinix handset w… [+121 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Creative Bloq"
        },
        "author": "Beren Neale",
        "title": "The best iPhone 14 Pro Max cases in December 2022 - Creative Bloq",
        "description": "Keep your phone safe with the best iPhone 14 Pro Max cases.",
        "url": "https://www.creativebloq.com/buying-guides/best-iphone-14-pro-max-cases",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/YtMuMusHetSXgwRLXyFkFW-1200-80.jpeg",
        "publishedAt": "2022-12-07T13:06:28Z",
        "content": "Whether you're looking for an iPhone 14 case or an iPhone 14 Pro case, the first thing to decide is what kind of protection you want. Do you want a super slim case that protects your phone from marks… [+1168 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "ExtremeTech"
        },
        "author": "Josh Norem",
        "title": "AMD Is Rumored to Be Readying Ryzen 7000X3D 3D V-Cache CPUs - ExtremeTech",
        "description": "This news will be music to the ears of many potential AMD upgraders who have been waiting to pull the trigger on a new V-Cache system.",
        "url": "https://www.extremetech.com/?p=341364",
        "urlToImage": "https://www.extremetech.com/wp-content/uploads/2022/09/Screen-Shot-2022-09-02-at-11.03.01-AM-640x360.png",
        "publishedAt": "2022-12-07T13:03:00Z",
        "content": "When AMD launched its new Zen 4 CPU lineup in September, there was an elephant in the room. What about the V-Cache versions? AMD showed no such CPUs, even though it had shown them on the official roa… [+3536 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "MyBroadband"
        },
        "author": "https://www.facebook.com/mybroadband",
        "title": "Huge Google Search change - MyBroadband",
        "description": "The change makes the Google Search experience similar to feeds on social media apps, like Twitter and Facebook.",
        "url": "https://mybroadband.co.za/news/internet/473005-huge-google-search-change.html",
        "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2021/09/Google-Search-headline.jpg",
        "publishedAt": "2022-12-07T13:01:50Z",
        "content": "Google has started rolling out continuous scrolling for search results on desktop browsers.\r\nFrom Tuesday, 6 December 2022, English users of Google Search in the US will see the content from up to si… [+1931 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": "cbc-news",
            "name": "CBC News"
        },
        "author": null,
        "title": "Microsoft, Nintendo reach deal to keep Call of Duty available to Switch players - CBC News",
        "description": "Microsoft said Wednesday that it struck a deal to make the hit video game Call of Duty available on Nintendo for 10 years when its $69-billion US purchase of game maker Activision Blizzard goes through — an apparent attempt to fend off objections from rival S…",
        "url": "https://www.cbc.ca/news/entertainment/microsoft-nintendo-deal-1.6676957",
        "urlToImage": "https://i.cbc.ca/1.6676973.1670416789!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/activision-m-a-microsoft-corp.JPG",
        "publishedAt": "2022-12-07T13:01:12Z",
        "content": "Microsoft said Wednesday that it struck a deal to make the hit video game Call of Duty available on Nintendo for 10 years when its $69-billion US purchase of game maker Activision Blizzard goes throu… [+2204 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Moneycontrol"
        },
        "author": "Moneycontrol News",
        "title": "Xiaomi 13 series launch date rescheduled for December 11 - Moneycontrol",
        "description": "The Xiaomi 13 and Xiaomi 13 Pro were set to make their debut in China earlier this month on December 1. But was indefinitely postponed following the death of Jiang Zemin - the former General Secretary of the Chinese Communist Party.",
        "url": "https://www.moneycontrol.com/news/technology/xiaomi-13-series-launch-date-rescheduled-for-december-11-9665961.html",
        "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/11/xiaomi-13-series-770x433.jpg",
        "publishedAt": "2022-12-07T12:54:44Z",
        "content": "The Xiaomi 13 series is available for pre-order in China ahead of its launch. The Xiaomi 13 and Xiaomi 13 Pro were set to make their debut in China earlier this month on December 1. But was indefinit… [+1452 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "NDTV News"
        },
        "author": null,
        "title": "Oppo Reno 8 Pro House of the Dragon Limited Edition Set Launched in India: Price, Specifications - NDTV",
        "description": "Oppo Reno 8 Pro House of the Dragon Limited Edition Set has been launched in India. It is priced at Rs. 45,999 and will be sold via Flipkart. It includes a House of the Dragon-inspired collectable dragon egg and other accessories.",
        "url": "https://www.ndtv.com/tech/oppo-reno-8-pro-house-of-the-dragon-price-in-india-rs-45999-launch-specifications-limited-edition-3586029",
        "urlToImage": "https://c.ndtvimg.com/2022-12/5fh893mg_opporeno8prohouseofthedragonlimitededitionsetsmall_625x300_07_December_22.jpg",
        "publishedAt": "2022-12-07T12:47:41Z",
        "content": "It includes a House of the Dragon-inspired special collectable dragon egg\r\nHighlights\r\n<ul><li>Oppo Reno 8 Pro is powered by a MediaTek Dimensity 8100-Max SoC\r\n</li><li>Fans can pre-book this collect… [+2062 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "MacRumors"
        },
        "author": "Tim Hardwick",
        "title": "Proton Drive iOS and Android Apps Now Available for Encrypted Cloud Storage - MacRumors",
        "description": "Swiss-based privacy startup Proton today announced the availability of mobile apps for its Proton Drive cloud storage service, providing users with...",
        "url": "https://www.macrumors.com/2022/12/07/proton-drive-ios-app-encrypted-cloud-storage/",
        "urlToImage": "https://images.macrumors.com/t/ERK9JsAE1331Yz0JZ0ZiEJuetgo=/1600x/article-new/2022/12/Proton_Drive.jpg.jpg",
        "publishedAt": "2022-12-07T12:45:13Z",
        "content": "Swiss-based privacy startup Proton today announced the availability of mobile apps for its Proton Drive cloud storage service, providing users with an easier way to securely upload, store, and share … [+2256 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Rocketleague.com"
        },
        "author": "Psyonix Team",
        "title": "Cabined Accounts Come to Rocket League - Rocket League",
        "description": "Learn how an Epic Games Cabined Account works in Rocket League. Parental consent may be required in order to access certain features depending on your age.",
        "url": "https://www.rocketleague.com/cabined-accounts-come-to-rocket-league",
        "urlToImage": "https://rocketleague.media.zestyio.com/rl_gameplay_june-2018_23_1080.Hysjz-OPo.jpg?width=1200&height=630&fit=crop",
        "publishedAt": "2022-12-07T12:44:10Z",
        "content": "Starting today, Epic will begin the rollout of Cabined Accounts, a new type of Epic account providing a tailored experience that is safe and inclusive for younger players while maintaining access to … [+952 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Video Games Chronicle"
        },
        "author": "Jordan Middler",
        "title": "Nintendo UK is giving away Mario Kart Live or Skyward Sword HD free with Switch OLEDs this Christmas | VGC - Video Games Chronicle",
        "description": "My Nintendo Store UK will be offering a choice of free games for customers who purchase a Nintendo Switch OLED model from this Friday. Customers who purchase a Nintendo Switch OLED model from the store will have the option of either Mario Kart Live: Home Circ…",
        "url": "https://www.videogameschronicle.com/news/nintendo-uk-is-giving-away-mario-kart-live-or-skyward-sword-hd-free-with-switch-oleds-this-christmas/",
        "urlToImage": "https://www.videogameschronicle.com/files/2022/08/mario-kart-live-home-circuit.jpg",
        "publishedAt": "2022-12-07T12:36:42Z",
        "content": "The official UK My Nintendo Store will be offering a choice of two free games, including the £99 Mario Kart Live: Home Circuit, for anyone who buys a Nintendo Switch OLED model.\r\nStarting this Friday… [+2070 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Ryan Dinsdale",
        "title": "Elden Ring DLC Comes With a Ton of Balance Updates, Bug Fixes, and New Hairstyles - IGN",
        "description": "Elden Ring's free Colosseum Update has arrived alongside a ton of balance changes, bug fixes, and even new hairstyles in Version 1.08.",
        "url": "https://www.ign.com/articles/elden-ring-dlc-comes-with-a-ton-of-balance-updates-bug-fixes-and-new-hairstyles",
        "urlToImage": "https://assets-prd.ignimgs.com/2022/12/06/eldenringfreecolosseumupdatetrailer-ign-blogroll-1670336339684.jpg?width=1280",
        "publishedAt": "2022-12-07T12:33:50Z",
        "content": "Elden Ring's free Colosseum Update has arrived alongside a ton of balance changes, bug fixes, and even new hairstyles for the game's character creation.\r\nOutlined in a Bandai Namco blog post, Elden R… [+4695 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "The Quint"
        },
        "author": "Raajwrita Dutta",
        "title": "WhatsApp To Roll Out 21 New Emojis & Picture-in-Picture View Update; Details - The Quint",
        "description": "WhatsApp is getting ready to launch a bunch of new features for users. Reports suggest that it will launch 21 new emojis and picture-in-picture view update for iOS soon.",
        "url": "https://www.thequint.com/tech-and-auto/tech-news/whatsapp-to-launch-21-new-emojis-picture-in-picture-view-know-details-about-upcoming-features",
        "urlToImage": "https://images.thequint.com/thequint%2F2022-12%2Ff3f46cf7-4ea3-4b78-ae3c-657726c8bc60%2FiStock_564606750__1_.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true",
        "publishedAt": "2022-12-07T12:32:51Z",
        "content": "The Meta-owned application, WhatsApp is currently planning to roll out several new updates on the platform. The updates and features are introduced to help users have a better experience on the messa… [+637 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Digital Trends"
        },
        "author": "Joseph Yaden",
        "title": "Fortnite Chapter 4 has completely stolen Warzone 2.0’s thunder - Digital Trends",
        "description": "Following the launch of Fortnite Chapter 4, it's clear that Call of Duty: Warzone 2.0 is lagging behind in the battle royale space.",
        "url": "https://www.digitaltrends.com/gaming/fortnite-chapter-4-steals-warzone-thunder/",
        "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/12/Fortnite_20221206100048.jpg?p=1",
        "publishedAt": "2022-12-07T12:30:00Z",
        "content": "Although Call of Duty: Warzone 2.0 reached a whopping 25 million players within five days of its launch, the shooter launched in a troubled state. It’s full of bugs and controversial design choices t… [+5319 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": "financial-times",
            "name": "Financial Times"
        },
        "author": "Kana Inagaki, Tim Bradshaw",
        "title": "Microsoft signs 10-year 'Call of Duty' deal with Nintendo - Financial Times",
        "description": "US tech group tries to address antitrust concerns over acquisition of Activision Blizzard",
        "url": "https://www.ft.com/content/e1d4a7da-b208-4f2e-84ed-9d84c763b152",
        "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F3b404891-daa6-4c7f-9680-747b93bf06bf.jpg?source=next-opengraph&fit=scale-down&width=900",
        "publishedAt": "2022-12-07T12:25:19Z",
        "content": "Microsoft has signed a 10-year deal to bring Call of Duty, one of the worlds most popular gaming franchises, to Nintendos platforms for the first time in almost a decade, following its planned $75bn … [+2495 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Tom's Guide"
        },
        "author": "Tom Pritchard",
        "title": "MacBook Pro 2023 leaker just tipped three major upgrades - Tom's Guide",
        "description": "2023 MacBook Pros could pack some hefty hardware",
        "url": "https://www.tomsguide.com/news/macbook-pro-2023-leaker-just-tipped-three-major-upgrades",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/wKaEoNvjNpRkyZH74YAq2B-1200-80.jpg",
        "publishedAt": "2022-12-07T12:24:45Z",
        "content": "As impressive as the Apple M2 chip is inside the MacBook Air M2 and MacBook Pro M2 13-inch, it will be surpassed soon. A new leak from tipster LeaksApplePro says to expect big things from the 2023 Ma… [+1751 chars]",
        "category": "technology"
    },
    {
        "source": {
            "id": null,
            "name": "Livemint"
        },
        "author": "Paurush Omar",
        "title": "Call of Duty now on Switch as Microsoft strikes 10-year deal with Nintendo | Mint - Mint",
        "description": "The agreement will expand the number of platforms and gamers who can play Call of Duty",
        "url": "https://www.livemint.com/technology/tech-news/call-of-duty-now-on-switch-as-microsoft-strikes-10-year-deal-with-nintendo-11670414114051.html",
        "urlToImage": "https://images.livemint.com/img/2022/12/07/600x338/callofduty_1670414925306_1670414925489_1670414925489.png",
        "publishedAt": "2022-12-07T12:18:13Z",
        "content": "In an apparent effort to overcome opposition from rival Sony, Microsoft announced on Wednesday that it had reached an agreement to make the popular video game Call of Duty available on Nintendo for 1… [+1772 chars]",
        "category": "technology"
    }
]
